FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
/* Copyright 2019 The ChromiumOS Authors
 * Use of this source code is governed by a BSD-style license that can be
 * found in the LICENSE file.
 */

/**
 * @file
 * @brief Register map for the STM32L5 family of chips
 *
 * This header file should not be included directly.
 * Please include registers.h instead.
 *
 * Known Chip Variants
 * - STM32L552
 */

#ifndef __CROS_EC_REGISTERS_H
#error "This header file should not be included directly."
#endif

/******  STM32 specific Interrupt Numbers ********/
#define STM32_IRQ_WWDG 0
#define STM32_IRQ_PVD 1
#define STM32_IRQ_RTC_ALARM 2
#define STM32_IRQ_FLASH 6
#define STM32_IRQ_FLASH_S 7
#define STM32_IRQ_RCC 9
#define STM32_IRQ_RCC_S 10
#define STM32_IRQ_EXTI0 11
#define STM32_IRQ_EXTI1 12
#define STM32_IRQ_EXTI2 13
#define STM32_IRQ_EXTI3 14
#define STM32_IRQ_EXTI4 15
#define STM32_IRQ_EXTI5 16
#define STM32_IRQ_EXTI6 17
#define STM32_IRQ_EXTI7 18
#define STM32_IRQ_EXTI8 19
#define STM32_IRQ_EXTI9 20
#define STM32_IRQ_EXTI10 21
#define STM32_IRQ_EXTI11 22
#define STM32_IRQ_EXTI12 23
#define STM32_IRQ_EXTI13 24
#define STM32_IRQ_EXTI14 25
#define STM32_IRQ_EXTI15 26
#define STM32_IRQ_DMAMUX_OVR 27
#define STM32_IRQ_DMAMUX_OVR_S 28
#define STM32_IRQ_DMA_CHANNEL_1 29
#define STM32_IRQ_DMA_CHANNEL_2 30
#define STM32_IRQ_DMA_CHANNEL_3 31
#define STM32_IRQ_DMA_CHANNEL_4 32
#define STM32_IRQ_DMA_CHANNEL_5 33
#define STM32_IRQ_DMA_CHANNEL_6 34
#define STM32_IRQ_DMA_CHANNEL_7 35
#define STM32_IRQ_DMA_CHANNEL_8 36
#define STM32_IRQ_ADC1 37
#define STM32_IRQ_TIM1_BRK 41
#define STM32_IRQ_TIM1_UP 42
#define STM32_IRQ_TIM1_TRG_COM 43
#define STM32_IRQ_TIM1_CC 44
#define STM32_IRQ_TIM2 45
#define STM32_IRQ_TIM3 46
#define STM32_IRQ_TIM4 47
#define STM32_IRQ_TIM5 48
#define STM32_IRQ_TIM6 49
#define STM32_IRQ_TIM7 50
#define STM32_IRQ_TIM8_BRK 51
#define STM32_IRQ_TIM8_UP 52
#define STM32_IRQ_TIM8_TRG_COM 53
#define STM32_IRQ_TIM8_CC 54
#define STM32_IRQ_I2C1_EV 55
#define STM32_IRQ_I2C1_ER 56
#define STM32_IRQ_I2C2_EV 57
#define STM32_IRQ_I2C2_ER 58
#define STM32_IRQ_SPI1 59
#define STM32_IRQ_SPI2 60
#define STM32_IRQ_USART1 61
#define STM32_IRQ_USART2 62
#define STM32_IRQ_USART3 63
#define STM32_IRQ_USART4 64
#define STM32_IRQ_USART5 65
#define STM32_IRQ_LPUART1 66
#define STM32_IRQ_LPTIM1 67
#define STM32_IRQ_LPTIM2 68
#define STM32_IRQ_TIM15 69
#define STM32_IRQ_TIM16 70
#define STM32_IRQ_TIM17 71
#define STM32_IRQ_COMP 72
#define STM32_IRQ_USB_FS 73
#define STM32_IRQ_CRS 74
#define STM32_IRQ_FMC 75
#define STM32_IRQ_DMA2_CHANNEL1 80
#define STM32_IRQ_DMA2_CHANNEL2 81
#define STM32_IRQ_DMA2_CHANNEL3 82
#define STM32_IRQ_DMA2_CHANNEL4 83
#define STM32_IRQ_DMA2_CHANNEL5 84
#define STM32_IRQ_DMA2_CHANNEL6 85
#define STM32_IRQ_DMA2_CHANNEL7 86
#define STM32_IRQ_DMA2_CHANNEL8 87

/* To simplify code generation, define DMA channel 9..16 */
#define STM32_IRQ_DMA_CHANNEL_9 STM32_IRQ_DMA2_CHANNEL1
#define STM32_IRQ_DMA_CHANNEL_10 STM32_IRQ_DMA2_CHANNEL2
#define STM32_IRQ_DMA_CHANNEL_11 STM32_IRQ_DMA2_CHANNEL3
#define STM32_IRQ_DMA_CHANNEL_12 STM32_IRQ_DMA2_CHANNEL4
#define STM32_IRQ_DMA_CHANNEL_13 STM32_IRQ_DMA2_CHANNEL5
#define STM32_IRQ_DMA_CHANNEL_14 STM32_IRQ_DMA2_CHANNEL6
#define STM32_IRQ_DMA_CHANNEL_15 STM32_IRQ_DMA2_CHANNEL7
#define STM32_IRQ_DMA_CHANNEL_16 STM32_IRQ_DMA2_CHANNEL8

/* aliases for easier code sharing */
#define STM32_IRQ_I2C1 STM32_IRQ_I2C1_EV
#define STM32_IRQ_I2C2 STM32_IRQ_I2C2_EV
#define STM32_IRQ_I2C3 STM32_IRQ_I2C3_EV
#define STM32_IRQ_USB_LP STM32_IRQ_USB_FS

#define PERIPH_BASE 0x40000000UL

/*!< Peripheral memory map */
#define APB1PERIPH_BASE PERIPH_BASE
#define APB2PERIPH_BASE (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE (PERIPH_BASE + 0x02000000UL)
#define AHB3PERIPH_BASE (PERIPH_BASE + 0x04000000UL)

/*!< APB1 peripherals */
#define STM32_TIM2_BASE (APB1PERIPH_BASE + 0x0000UL)
#define STM32_TIM3_BASE (APB1PERIPH_BASE + 0x0400UL)
#define STM32_TIM4_BASE (APB1PERIPH_BASE + 0x0800UL)
#define STM32_TIM5_BASE (APB1PERIPH_BASE + 0x0C00UL)
#define STM32_TIM6_BASE (APB1PERIPH_BASE + 0x1000UL)
#define STM32_TIM7_BASE (APB1PERIPH_BASE + 0x1400UL)
#define STM32_RTC_BASE (APB1PERIPH_BASE + 0x2800UL)
#define STM32_WWDG_BASE (APB1PERIPH_BASE + 0x2C00UL)
#define STM32_IWDG_BASE (APB1PERIPH_BASE + 0x3000UL)
#define STM32_TAMP_BASE (APB1PERIPH_BASE + 0x3400UL)
#define STM32_SPI2_BASE (APB1PERIPH_BASE + 0x3800UL)
#define STM32_SPI3_BASE (APB1PERIPH_BASE + 0x3C00UL)
#define STM32_USART2_BASE (APB1PERIPH_BASE + 0x4400UL)
#define STM32_USART3_BASE (APB1PERIPH_BASE + 0x4800UL)
#define STM32_USART4_BASE (APB1PERIPH_BASE + 0x4c00UL)
#define STM32_USART5_BASE (APB1PERIPH_BASE + 0x5000UL)
#define STM32_I2C1_BASE (APB1PERIPH_BASE + 0x5400UL)
#define STM32_I2C2_BASE (APB1PERIPH_BASE + 0x5800UL)
#define STM32_I2C3_BASE (APB1PERIPH_BASE + 0x5C00UL)
#define STM32_CRS_BASE (APB1PERIPH_BASE + 0x6000UL)
#define STM32_PWR_BASE (APB1PERIPH_BASE + 0x7000UL)
#define STM32_DAC_BASE (APB1PERIPH_BASE + 0x7400UL)
#define STM32_DAC1_BASE (APB1PERIPH_BASE + 0x7400UL)
#define STM32_OPAMP_BASE (APB1PERIPH_BASE + 0x7800UL)
#define STM32_LPTIM1_BASE (APB1PERIPH_BASE + 0x7C00UL)
#define STM32_LPUART1_BASE (APB1PERIPH_BASE + 0x8000UL)
#define STM32_I2C4_BASE (APB1PERIPH_BASE + 0x8400UL)
#define STM32_LPTIM2_BASE (APB1PERIPH_BASE + 0x9400UL)
#define STM32_LPTIM3_BASE (APB1PERIPH_BASE + 0x9800UL)
#define STM32_FDCAN_RAM_BASE (APB1PERIPH_BASE + 0xA400UL)
#define STM32_CAN_RAM_BASE (APB1PERIPH_BASE + 0xAC00UL)
#define STM32_USB_FS_BASE (APB1PERIPH_BASE + 0xD400UL)
#define STM32_USB_CAN_SRAM_BASE (APB1PERIPH_BASE + 0xD800UL)
#define STM32_UCPD1_BASE (APB1PERIPH_BASE + 0xDC00UL)

/*!< APB2 peripherals */
#define STM32_SYSCFG_BASE (APB2PERIPH_BASE + 0x0000UL)
#define STM32_EXTI_BASE (AHB1PERIPH_BASE + 0xf400UL)
#define STM32_TIM1_BASE (APB2PERIPH_BASE + 0x2C00UL)
#define STM32_SPI1_BASE (APB2PERIPH_BASE + 0x3000UL)
#define STM32_TIM8_BASE (APB2PERIPH_BASE + 0x3400UL)
#define STM32_USART1_BASE (APB2PERIPH_BASE + 0x3800UL)
#define STM32_TIM15_BASE (APB2PERIPH_BASE + 0x4000UL)
#define STM32_TIM16_BASE (APB2PERIPH_BASE + 0x4400UL)
#define STM32_TIM17_BASE (APB2PERIPH_BASE + 0x4800UL)

/*!< AHB1 peripherals */
#define STM32_DMA1_BASE (AHB1PERIPH_BASE + 0x0000UL)
#define STM32_DMA2_BASE (AHB1PERIPH_BASE + 0x0400UL)
#define STM32_DMAMUX_BASE (AHB1PERIPH_BASE + 0x0800UL)
#define STM32_RCC_BASE (AHB1PERIPH_BASE + 0x1000UL)
#define STM32_FLASH_R_BASE (AHB1PERIPH_BASE + 0x2000UL)
#define STM32_CRC_BASE (AHB1PERIPH_BASE + 0x3000UL)
#define STM32_DMA1_Channel1_BASE (DMA1_BASE + 0x0008UL)
#define STM32_DMA1_Channel2_BASE (DMA1_BASE + 0x001CUL)
#define STM32_DMA1_Channel3_BASE (DMA1_BASE + 0x0030UL)
#define STM32_DMA1_Channel4_BASE (DMA1_BASE + 0x0044UL)
#define STM32_DMA1_Channel5_BASE (DMA1_BASE + 0x0058UL)
#define STM32_DMA1_Channel6_BASE (DMA1_BASE + 0x006CUL)
#define STM32_DMA1_Channel7_BASE (DMA1_BASE + 0x0080UL)
#define STM32_DMA1_CSELR_BASE (DMA1_BASE + 0x00A8UL)
#define STM32_DMA2_Channel1_BASE (DMA2_BASE + 0x0008UL)
#define STM32_DMA2_Channel2_BASE (DMA2_BASE + 0x001CUL)
#define STM32_DMA2_Channel3_BASE (DMA2_BASE + 0x0030UL)
#define STM32_DMA2_Channel4_BASE (DMA2_BASE + 0x0044UL)
#define STM32_DMA2_Channel5_BASE (DMA2_BASE + 0x0058UL)
#define STM32_DMA2_Channel6_BASE (DMA2_BASE + 0x006CUL)
#define STM32_DMA2_Channel7_BASE (DMA2_BASE + 0x0080UL)
#define STM32_DMA2_CSELR_BASE (DMA2_BASE + 0x00A8UL)

/*!< AHB2 peripherals */
#define STM32_GPIOA_BASE (AHB2PERIPH_BASE + 0x20000UL)
#define STM32_GPIOB_BASE (AHB2PERIPH_BASE + 0x20400UL)
#define STM32_GPIOC_BASE (AHB2PERIPH_BASE + 0x20800UL)
#define STM32_GPIOD_BASE (AHB2PERIPH_BASE + 0x20C00UL)
#define STM32_GPIOE_BASE (AHB2PERIPH_BASE + 0x21000UL)
#define STM32_GPIOF_BASE (AHB2PERIPH_BASE + 0x21400UL)
#define STM32_GPIOG_BASE (AHB2PERIPH_BASE + 0x21800UL)
#define STM32_GPIOH_BASE (AHB2PERIPH_BASE + 0x21C00UL)
#define STM32_RNG_BASE (AHB2PERIPH_BASE + 0xC4000UL)

/*!< AHB3 peripherals */
#define STM32_OCTOSPI_BASE (AHB3PERIPH_BASE + 0x21000UL)

