FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
#define STM32_RCC_CCIPR_CLK48_NONE 0
#define STM32_RCC_CCIPR_CLK48_PLL48M2CLK 1
#define STM32_RCC_CCIPR_CLK48_PLL48M1CLK 2
#define STM32_RCC_CCIPR_CLK48_MSI 3

#define STM32_RCC_CCIPR_ADC_NONE 0
#define STM32_RCC_CCIPR_ADC_PLLADC1CLK 1
#define STM32_RCC_CCIPR_ADC_PLLADC2CLK 2
#define STM32_RCC_CCIPR_ADC_SYSCLK 3

#define STM32_RCC_CCIPR_SWPMI_PCLK 0
#define STM32_RCC_CCIPR_SWPMI_HSI16 1

#define STM32_RCC_CCIPR_DFSDM_PCLK 0
#define STM32_RCC_CCIPR_DFSDM_SYSCLK 1

#define STM32_RCC_CR REG32(STM32_RCC_BASE + 0x00)
#define STM32_RCC_ICSCR REG32(STM32_RCC_BASE + 0x04)
#define STM32_RCC_CFGR REG32(STM32_RCC_BASE + 0x08)
#define STM32_RCC_PLLCFGR REG32(STM32_RCC_BASE + 0x0C)
#define STM32_RCC_PLLSAI1CFGR REG32(STM32_RCC_BASE + 0x10)
#define STM32_RCC_RESERVED REG32(STM32_RCC_BASE + 0x14)
#define STM32_RCC_CIER REG32(STM32_RCC_BASE + 0x18)
#define STM32_RCC_CIFR REG32(STM32_RCC_BASE + 0x1C)
#define STM32_RCC_CICR REG32(STM32_RCC_BASE + 0x20)
#define STM32_RCC_RESERVED0 REG32(STM32_RCC_BASE + 0x24)
#define STM32_RCC_AHB1RSTR REG32(STM32_RCC_BASE + 0x28)
#define STM32_RCC_AHB2RSTR REG32(STM32_RCC_BASE + 0x2C)
#define STM32_RCC_AHB3RSTR REG32(STM32_RCC_BASE + 0x30)
#define STM32_RCC_RESERVED1 REG32(STM32_RCC_BASE + 0x34)
#define STM32_RCC_APB1RSTR1 REG32(STM32_RCC_BASE + 0x38)
#define STM32_RCC_APB1RSTR2 REG32(STM32_RCC_BASE + 0x3C)
#define STM32_RCC_APB2RSTR REG32(STM32_RCC_BASE + 0x40)
#define STM32_RCC_RESERVED2 REG32(STM32_RCC_BASE + 0x44)
#define STM32_RCC_AHB1ENR REG32(STM32_RCC_BASE + 0x48)
#define STM32_RCC_AHB2ENR REG32(STM32_RCC_BASE + 0x4C)
#define STM32_RCC_AHB3ENR REG32(STM32_RCC_BASE + 0x50)
#define STM32_RCC_RESERVED3 REG32(STM32_RCC_BASE + 0x54)
#define STM32_RCC_APB1ENR1 REG32(STM32_RCC_BASE + 0x58)
#define STM32_RCC_APB1ENR2 REG32(STM32_RCC_BASE + 0x5C)
#define STM32_RCC_APB2ENR REG32(STM32_RCC_BASE + 0x60)
#define STM32_RCC_RESERVED4 REG32(STM32_RCC_BASE + 0x64)
#define STM32_RCC_AHB1SMENR REG32(STM32_RCC_BASE + 0x68)
#define STM32_RCC_AHB2SMENR REG32(STM32_RCC_BASE + 0x6C)
#define STM32_RCC_AHB3SMENR REG32(STM32_RCC_BASE + 0x70)
#define STM32_RCC_RESERVED5 REG32(STM32_RCC_BASE + 0x74)
#define STM32_RCC_APB1SMENR1 REG32(STM32_RCC_BASE + 0x78)
#define STM32_RCC_APB1SMENR2 REG32(STM32_RCC_BASE + 0x7C)
#define STM32_RCC_APB2SMENR REG32(STM32_RCC_BASE + 0x80)
#define STM32_RCC_RESERVED6 REG32(STM32_RCC_BASE + 0x84)
#define STM32_RCC_CCIPR1 REG32(STM32_RCC_BASE + 0x88)
#define STM32_RCC_CCIPR STM32_RCC_CCIPR1
#define STM32_RCC_RESERVED7 REG32(STM32_RCC_BASE + 0x8C)
#define STM32_RCC_BDCR REG32(STM32_RCC_BASE + 0x90)
#define STM32_RCC_CSR REG32(STM32_RCC_BASE + 0x94)
#define STM32_RCC_CRRCR REG32(STM32_RCC_BASE + 0x98)
#define STM32_RCC_CCIPR2 REG32(STM32_RCC_BASE + 0x9C)
#define STM32_CRS_CR REG32(STM32_CRS_BASE + 0x00)
#define STM32_CRS_CFGR REG32(STM32_CRS_BASE + 0x04)
#define STM32_CRS_ISR REG32(STM32_CRS_BASE + 0x08)
#define STM32_CRS_ICR REG32(STM32_CRS_BASE + 0x0C)

#define STM32_RCC_PLLSAI1_SUPPORT
#define STM32_RCC_PLLP_SUPPORT
#define STM32_RCC_HSI48_SUPPORT
#define STM32_RCC_PLLP_DIV_2_31_SUPPORT
#define STM32_RCC_PLLSAI1P_DIV_2_31_SUPPORT

#define STM32_RCC_APB1ENR STM32_RCC_APB1ENR1

/********************  BIT DEFINITION FOR STM32_RCC_CR REGISTER  **************/
#define STM32_RCC_CR_MSION_POS 0U
#define STM32_RCC_CR_MSION_MSK (0x1UL << STM32_RCC_CR_MSION_POS)
#define STM32_RCC_CR_MSION STM32_RCC_CR_MSION_MSK
#define STM32_RCC_CR_MSIRDY_POS 1U
#define STM32_RCC_CR_MSIRDY_MSK (0x1UL << STM32_RCC_CR_MSIRDY_POS)
#define STM32_RCC_CR_MSIRDY STM32_RCC_CR_MSIRDY_MSK
#define STM32_RCC_CR_MSIPLLEN_POS 2U
#define STM32_RCC_CR_MSIPLLEN_MSK (0x1UL << STM32_RCC_CR_MSIPLLEN_POS)
#define STM32_RCC_CR_MSIPLLEN STM32_RCC_CR_MSIPLLEN_MSK
#define STM32_RCC_CR_MSIRGSEL_POS 3U
#define STM32_RCC_CR_MSIRGSEL_MSK (0x1UL << STM32_RCC_CR_MSIRGSEL_POS)
#define STM32_RCC_CR_MSIRGSEL STM32_RCC_CR_MSIRGSEL_MSK

/*!< MSIRANGE CONFIGURATION : 12 FREQUENCY RANGES AVAILABLE */
#define STM32_RCC_CR_MSIRANGE_POS 4U
#define STM32_RCC_CR_MSIRANGE_MSK (0xFUL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE STM32_RCC_CR_MSIRANGE_MSK
#define STM32_RCC_CR_MSIRANGE_0 (0x0UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_1 (0x1UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_2 (0x2UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_3 (0x3UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_4 (0x4UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_5 (0x5UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_6 (0x6UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_7 (0x7UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_8 (0x8UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_9 (0x9UL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_10 (0xAUL << STM32_RCC_CR_MSIRANGE_POS)
#define STM32_RCC_CR_MSIRANGE_11 (0xBUL << STM32_RCC_CR_MSIRANGE_POS)

#define STM32_RCC_CR_HSION_POS 8U
#define STM32_RCC_CR_HSION_MSK (0x1UL << STM32_RCC_CR_HSION_POS)
#define STM32_RCC_CR_HSION STM32_RCC_CR_HSION_MSK
#define STM32_RCC_CR_HSIKERON_POS 9U
#define STM32_RCC_CR_HSIKERON_MSK (0x1UL << STM32_RCC_CR_HSIKERON_POS)
#define STM32_RCC_CR_HSIKERON STM32_RCC_CR_HSIKERON_MSK
#define STM32_RCC_CR_HSIRDY_POS 10U
#define STM32_RCC_CR_HSIRDY_MSK (0x1UL << STM32_RCC_CR_HSIRDY_POS)
#define STM32_RCC_CR_HSIRDY STM32_RCC_CR_HSIRDY_MSK
#define STM32_RCC_CR_HSIASFS_POS 11U
#define STM32_RCC_CR_HSIASFS_MSK (0x1UL << STM32_RCC_CR_HSIASFS_POS)
#define STM32_RCC_CR_HSIASFS STM32_RCC_CR_HSIASFS_MSK

#define STM32_RCC_CR_HSEON_POS 16U
#define STM32_RCC_CR_HSEON_MSK (0x1UL << STM32_RCC_CR_HSEON_POS)
#define STM32_RCC_CR_HSEON STM32_RCC_CR_HSEON_MSK
#define STM32_RCC_CR_HSERDY_POS 17U
#define STM32_RCC_CR_HSERDY_MSK (0x1UL << STM32_RCC_CR_HSERDY_POS)
#define STM32_RCC_CR_HSERDY STM32_RCC_CR_HSERDY_MSK
#define STM32_RCC_CR_HSEBYP_POS 18U
#define STM32_RCC_CR_HSEBYP_MSK (0x1UL << STM32_RCC_CR_HSEBYP_POS)
#define STM32_RCC_CR_HSEBYP STM32_RCC_CR_HSEBYP_MSK
#define STM32_RCC_CR_CSSON_POS 19U
#define STM32_RCC_CR_CSSON_MSK (0x1UL << STM32_RCC_CR_CSSON_POS)
#define STM32_RCC_CR_CSSON STM32_RCC_CR_CSSON_MSK

#define STM32_RCC_CR_PLLON_POS 24U
#define STM32_RCC_CR_PLLON_MSK (0x1UL << STM32_RCC_CR_PLLON_POS)
#define STM32_RCC_CR_PLLON STM32_RCC_CR_PLLON_MSK
#define STM32_RCC_CR_PLLRDY_POS 25U
#define STM32_RCC_CR_PLLRDY_MSK (0x1UL << STM32_RCC_CR_PLLRDY_POS)
#define STM32_RCC_CR_PLLRDY STM32_RCC_CR_PLLRDY_MSK
#define STM32_RCC_CR_PLLSAI1ON_POS 26U
#define STM32_RCC_CR_PLLSAI1ON_MSK (0x1UL << STM32_RCC_CR_PLLSAI1ON_POS)
#define STM32_RCC_CR_PLLSAI1ON STM32_RCC_CR_PLLSAI1ON_MSK
#define STM32_RCC_CR_PLLSAI1RDY_POS 27U
#define STM32_RCC_CR_PLLSAI1RDY_MSK (0x1UL << STM32_RCC_CR_PLLSAI1RDY_POS)
#define STM32_RCC_CR_PLLSAI1RDY STM32_RCC_CR_PLLSAI1RDY_MSK

/********************  BIT DEFINITION FOR STM32_RCC_ICSCR REGISTER  ***********/
/*!< MSICAL CONFIGURATION */
#define STM32_RCC_ICSCR_MSICAL_POS 0U
#define STM32_RCC_ICSCR_MSICAL_MSK (0xFFUL << STM32_RCC_ICSCR_MSICAL_POS)
#define STM32_RCC_ICSCR_MSICAL STM32_RCC_ICSCR_MSICAL_MSK
#define STM32_RCC_ICSCR_MSICAL_0 (0x01UL << STM32_RCC_ICSCR_MSICAL_POS)
#define STM32_RCC_ICSCR_MSICAL_1 (0x02UL << STM32_RCC_ICSCR_MSICAL_POS)
#define STM32_RCC_ICSCR_MSICAL_2 (0x04UL << STM32_RCC_ICSCR_MSICAL_POS)
#define STM32_RCC_ICSCR_MSICAL_3 (0x08UL << STM32_RCC_ICSCR_MSICAL_POS)
#define STM32_RCC_ICSCR_MSICAL_4 (0x10UL << STM32_RCC_ICSCR_MSICAL_POS)
#define STM32_RCC_ICSCR_MSICAL_5 (0x20UL << STM32_RCC_ICSCR_MSICAL_POS)
#define STM32_RCC_ICSCR_MSICAL_6 (0x40UL << STM32_RCC_ICSCR_MSICAL_POS)
#define STM32_RCC_ICSCR_MSICAL_7 (0x80UL << STM32_RCC_ICSCR_MSICAL_POS)

/*!< MSITRIM CONFIGURATION */
#define STM32_RCC_ICSCR_MSITRIM_POS 8U
#define STM32_RCC_ICSCR_MSITRIM_MSK (0xFFUL << STM32_RCC_ICSCR_MSITRIM_POS)
#define STM32_RCC_ICSCR_MSITRIM STM32_RCC_ICSCR_MSITRIM_MSK
#define STM32_RCC_ICSCR_MSITRIM_0 (0x01UL << STM32_RCC_ICSCR_MSITRIM_POS)
#define STM32_RCC_ICSCR_MSITRIM_1 (0x02UL << STM32_RCC_ICSCR_MSITRIM_POS)
#define STM32_RCC_ICSCR_MSITRIM_2 (0x04UL << STM32_RCC_ICSCR_MSITRIM_POS)
#define STM32_RCC_ICSCR_MSITRIM_3 (0x08UL << STM32_RCC_ICSCR_MSITRIM_POS)
#define STM32_RCC_ICSCR_MSITRIM_4 (0x10UL << STM32_RCC_ICSCR_MSITRIM_POS)
#define STM32_RCC_ICSCR_MSITRIM_5 (0x20UL << STM32_RCC_ICSCR_MSITRIM_POS)
#define STM32_RCC_ICSCR_MSITRIM_6 (0x40UL << STM32_RCC_ICSCR_MSITRIM_POS)
#define STM32_RCC_ICSCR_MSITRIM_7 (0x80UL << STM32_RCC_ICSCR_MSITRIM_POS)

/*!< HSICAL CONFIGURATION */
#define STM32_RCC_ICSCR_HSICAL_POS 16U
#define STM32_RCC_ICSCR_HSICAL_MSK (0xFFUL << STM32_RCC_ICSCR_HSICAL_POS)
#define STM32_RCC_ICSCR_HSICAL STM32_RCC_ICSCR_HSICAL_MSK
#define STM32_RCC_ICSCR_HSICAL_0 (0x01UL << STM32_RCC_ICSCR_HSICAL_POS)
#define STM32_RCC_ICSCR_HSICAL_1 (0x02UL << STM32_RCC_ICSCR_HSICAL_POS)
#define STM32_RCC_ICSCR_HSICAL_2 (0x04UL << STM32_RCC_ICSCR_HSICAL_POS)
#define STM32_RCC_ICSCR_HSICAL_3 (0x08UL << STM32_RCC_ICSCR_HSICAL_POS)
#define STM32_RCC_ICSCR_HSICAL_4 (0x10UL << STM32_RCC_ICSCR_HSICAL_POS)
#define STM32_RCC_ICSCR_HSICAL_5 (0x20UL << STM32_RCC_ICSCR_HSICAL_POS)
#define STM32_RCC_ICSCR_HSICAL_6 (0x40UL << STM32_RCC_ICSCR_HSICAL_POS)
#define STM32_RCC_ICSCR_HSICAL_7 (0x80UL << STM32_RCC_ICSCR_HSICAL_POS)

/*!< HSITRIM CONFIGURATION */
#define STM32_RCC_ICSCR_HSITRIM_POS 24U
#define STM32_RCC_ICSCR_HSITRIM_MSK (0x1FUL << STM32_RCC_ICSCR_HSITRIM_POS)
#define STM32_RCC_ICSCR_HSITRIM STM32_RCC_ICSCR_HSITRIM_MSK
#define STM32_RCC_ICSCR_HSITRIM_0 (0x01UL << STM32_RCC_ICSCR_HSITRIM_POS)
#define STM32_RCC_ICSCR_HSITRIM_1 (0x02UL << STM32_RCC_ICSCR_HSITRIM_POS)
#define STM32_RCC_ICSCR_HSITRIM_2 (0x04UL << STM32_RCC_ICSCR_HSITRIM_POS)
#define STM32_RCC_ICSCR_HSITRIM_3 (0x08UL << STM32_RCC_ICSCR_HSITRIM_POS)
#define STM32_RCC_ICSCR_HSITRIM_4 (0x10UL << STM32_RCC_ICSCR_HSITRIM_POS)

/****************  BIT DEFINITION FOR STM32_RCC_CFGR REGISTER  **************/
/*!< SW CONFIGURATION */
#define STM32_RCC_CFGR_SW_POS 0U
#define STM32_RCC_CFGR_SW_MSK (0x3UL << STM32_RCC_CFGR_SW_POS)
#define STM32_RCC_CFGR_SW STM32_RCC_CFGR_SW_MSK
#define STM32_RCC_CFGR_SW_0 (0x1UL << STM32_RCC_CFGR_SW_POS)
#define STM32_RCC_CFGR_SW_1 (0x2UL << STM32_RCC_CFGR_SW_POS)

#define STM32_RCC_CFGR_SW_MSI (0x00000000UL)
#define STM32_RCC_CFGR_SW_HSI (0x00000001UL)
#define STM32_RCC_CFGR_SW_HSE (0x00000002UL)
#define STM32_RCC_CFGR_SW_PLL (0x00000003UL)

/*!< SWS CONFIGURATION */
#define STM32_RCC_CFGR_SWS_POS 2U
#define STM32_RCC_CFGR_SWS_MSK (0x3UL << STM32_RCC_CFGR_SWS_POS)
#define STM32_RCC_CFGR_SWS STM32_RCC_CFGR_SWS_MSK
#define STM32_RCC_CFGR_SWS_0 (0x1UL << STM32_RCC_CFGR_SWS_POS)
#define STM32_RCC_CFGR_SWS_1 (0x2UL << STM32_RCC_CFGR_SWS_POS)

#define STM32_RCC_CFGR_SWS_MSI (0x00000000UL)
#define STM32_RCC_CFGR_SWS_HSI (0x00000004UL)
#define STM32_RCC_CFGR_SWS_HSE (0x00000008UL)
#define STM32_RCC_CFGR_SWS_PLL (0x0000000CUL)

