FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
/*!< HPRE CONFIGURATION */
#define STM32_RCC_CFGR_HPRE_POS 4U
#define STM32_RCC_CFGR_HPRE_MSK (0xFUL << STM32_RCC_CFGR_HPRE_POS)
#define STM32_RCC_CFGR_HPRE STM32_RCC_CFGR_HPRE_MSK
#define STM32_RCC_CFGR_HPRE_0 (0x1UL << STM32_RCC_CFGR_HPRE_POS)
#define STM32_RCC_CFGR_HPRE_1 (0x2UL << STM32_RCC_CFGR_HPRE_POS)
#define STM32_RCC_CFGR_HPRE_2 (0x4UL << STM32_RCC_CFGR_HPRE_POS)
#define STM32_RCC_CFGR_HPRE_3 (0x8UL << STM32_RCC_CFGR_HPRE_POS)

#define STM32_RCC_CFGR_HPRE_DIV1 (0x00000000UL)
#define STM32_RCC_CFGR_HPRE_DIV2 (0x00000080UL)
#define STM32_RCC_CFGR_HPRE_DIV4 (0x00000090UL)
#define STM32_RCC_CFGR_HPRE_DIV8 (0x000000A0UL)
#define STM32_RCC_CFGR_HPRE_DIV16 (0x000000B0UL)
#define STM32_RCC_CFGR_HPRE_DIV64 (0x000000C0UL)
#define STM32_RCC_CFGR_HPRE_DIV128 (0x000000D0UL)
#define STM32_RCC_CFGR_HPRE_DIV256 (0x000000E0UL)
#define STM32_RCC_CFGR_HPRE_DIV512 (0x000000F0UL)

/*!< PPRE1 CONFIGURATION */
#define STM32_RCC_CFGR_PPRE1_POS 8U
#define STM32_RCC_CFGR_PPRE1_MSK (0x7UL << STM32_RCC_CFGR_PPRE1_POS)
#define STM32_RCC_CFGR_PPRE1 STM32_RCC_CFGR_PPRE1_MSK
#define STM32_RCC_CFGR_PPRE1_0 (0x1UL << STM32_RCC_CFGR_PPRE1_POS)
#define STM32_RCC_CFGR_PPRE1_1 (0x2UL << STM32_RCC_CFGR_PPRE1_POS)
#define STM32_RCC_CFGR_PPRE1_2 (0x4UL << STM32_RCC_CFGR_PPRE1_POS)

#define STM32_RCC_CFGR_PPRE1_DIV1 (0x00000000UL)
#define STM32_RCC_CFGR_PPRE1_DIV2 (0x00000400UL)
#define STM32_RCC_CFGR_PPRE1_DIV4 (0x00000500UL)
#define STM32_RCC_CFGR_PPRE1_DIV8 (0x00000600UL)
#define STM32_RCC_CFGR_PPRE1_DIV16 (0x00000700UL)

/*!< PPRE2 CONFIGURATION */
#define STM32_RCC_CFGR_PPRE2_POS 11U
#define STM32_RCC_CFGR_PPRE2_MSK (0x7UL << STM32_RCC_CFGR_PPRE2_POS)
#define STM32_RCC_CFGR_PPRE2 STM32_RCC_CFGR_PPRE2_MSK
#define STM32_RCC_CFGR_PPRE2_0 (0x1UL << STM32_RCC_CFGR_PPRE2_POS)
#define STM32_RCC_CFGR_PPRE2_1 (0x2UL << STM32_RCC_CFGR_PPRE2_POS)
#define STM32_RCC_CFGR_PPRE2_2 (0x4UL << STM32_RCC_CFGR_PPRE2_POS)

#define STM32_RCC_CFGR_PPRE2_DIV1 (0x00000000UL)
#define STM32_RCC_CFGR_PPRE2_DIV2 (0x00002000UL)
#define STM32_RCC_CFGR_PPRE2_DIV4 (0x00002800UL)
#define STM32_RCC_CFGR_PPRE2_DIV8 (0x00003000UL)
#define STM32_RCC_CFGR_PPRE2_DIV16 (0x00003800UL)

#define STM32_RCC_CFGR_STOPWUCK_POS 15U
#define STM32_RCC_CFGR_STOPWUCK_MSK (0x1UL << STM32_RCC_CFGR_STOPWUCK_POS)
#define STM32_RCC_CFGR_STOPWUCK STM32_RCC_CFGR_STOPWUCK_MSK

/*!< MCOSEL CONFIGURATION */
#define STM32_RCC_CFGR_MCOSEL_POS 24U
#define STM32_RCC_CFGR_MCOSEL_MSK (0xFUL << STM32_RCC_CFGR_MCOSEL_POS)
#define STM32_RCC_CFGR_MCOSEL STM32_RCC_CFGR_MCOSEL_MSK
#define STM32_RCC_CFGR_MCOSEL_0 (0x1UL << STM32_RCC_CFGR_MCOSEL_POS)
#define STM32_RCC_CFGR_MCOSEL_1 (0x2UL << STM32_RCC_CFGR_MCOSEL_POS)
#define STM32_RCC_CFGR_MCOSEL_2 (0x4UL << STM32_RCC_CFGR_MCOSEL_POS)
#define STM32_RCC_CFGR_MCOSEL_3 (0x8UL << STM32_RCC_CFGR_MCOSEL_POS)

#define STM32_RCC_CFGR_MCOPRE_POS 28U
#define STM32_RCC_CFGR_MCOPRE_MSK (0x7UL << STM32_RCC_CFGR_MCOPRE_POS)
#define STM32_RCC_CFGR_MCOPRE STM32_RCC_CFGR_MCOPRE_MSK
#define STM32_RCC_CFGR_MCOPRE_0 (0x1UL << STM32_RCC_CFGR_MCOPRE_POS)
#define STM32_RCC_CFGR_MCOPRE_1 (0x2UL << STM32_RCC_CFGR_MCOPRE_POS)
#define STM32_RCC_CFGR_MCOPRE_2 (0x4UL << STM32_RCC_CFGR_MCOPRE_POS)

#define STM32_RCC_CFGR_MCOPRE_DIV1 (0x00000000UL)
#define STM32_RCC_CFGR_MCOPRE_DIV2 (0x10000000UL)
#define STM32_RCC_CFGR_MCOPRE_DIV4 (0x20000000UL)
#define STM32_RCC_CFGR_MCOPRE_DIV8 (0x30000000UL)
#define STM32_RCC_CFGR_MCOPRE_DIV16 (0x40000000UL)

/* LEGACY ALIASES */
#define STM32_RCC_CFGR_MCO_PRE STM32_RCC_CFGR_MCOPRE
#define STM32_RCC_CFGR_MCO_PRE_1 STM32_RCC_CFGR_MCOPRE_DIV1
#define STM32_RCC_CFGR_MCO_PRE_2 STM32_RCC_CFGR_MCOPRE_DIV2
#define STM32_RCC_CFGR_MCO_PRE_4 STM32_RCC_CFGR_MCOPRE_DIV4
#define STM32_RCC_CFGR_MCO_PRE_8 STM32_RCC_CFGR_MCOPRE_DIV8
#define STM32_RCC_CFGR_MCO_PRE_16 STM32_RCC_CFGR_MCOPRE_DIV16

/****************  BIT DEFINITION FOR STM32_RCC_PLLCFGR REGISTER  ***********/
#define STM32_RCC_PLLCFGR_PLLSRC_POS 0U
#define STM32_RCC_PLLCFGR_PLLSRC_MSK (0x3UL << STM32_RCC_PLLCFGR_PLLSRC_POS)
#define STM32_RCC_PLLCFGR_PLLSRC STM32_RCC_PLLCFGR_PLLSRC_MSK

#define STM32_RCC_PLLCFGR_PLLSRC_MSI_POS 0U
#define STM32_RCC_PLLCFGR_PLLSRC_MSI_MSK \
	(0x1UL << STM32_RCC_PLLCFGR_PLLSRC_MSI_POS)
#define STM32_RCC_PLLCFGR_PLLSRC_MSI STM32_RCC_PLLCFGR_PLLSRC_MSI_MSK
#define STM32_RCC_PLLCFGR_PLLSRC_HSI_POS 1U
#define STM32_RCC_PLLCFGR_PLLSRC_HSI_MSK \
	(0x1UL << STM32_RCC_PLLCFGR_PLLSRC_HSI_POS)
#define STM32_RCC_PLLCFGR_PLLSRC_HSI STM32_RCC_PLLCFGR_PLLSRC_HSI_MSK
#define STM32_RCC_PLLCFGR_PLLSRC_HSE_POS 0U
#define STM32_RCC_PLLCFGR_PLLSRC_HSE_MSK \
	(0x3UL << STM32_RCC_PLLCFGR_PLLSRC_HSE_POS)
#define STM32_RCC_PLLCFGR_PLLSRC_HSE STM32_RCC_PLLCFGR_PLLSRC_HSE_MSK

#define STM32_RCC_PLLCFGR_PLLM_POS 4U
#define STM32_RCC_PLLCFGR_PLLM_MSK (0x7UL << STM32_RCC_PLLCFGR_PLLM_POS)
#define STM32_RCC_PLLCFGR_PLLM STM32_RCC_PLLCFGR_PLLM_MSK
#define STM32_RCC_PLLCFGR_PLLM_0 (0x1UL << STM32_RCC_PLLCFGR_PLLM_POS)
#define STM32_RCC_PLLCFGR_PLLM_1 (0x2UL << STM32_RCC_PLLCFGR_PLLM_POS)
#define STM32_RCC_PLLCFGR_PLLM_2 (0x4UL << STM32_RCC_PLLCFGR_PLLM_POS)

#define STM32_RCC_PLLCFGR_PLLN_POS 8U
#define STM32_RCC_PLLCFGR_PLLN_MSK (0x7FUL << STM32_RCC_PLLCFGR_PLLN_POS)
#define STM32_RCC_PLLCFGR_PLLN STM32_RCC_PLLCFGR_PLLN_MSK
#define STM32_RCC_PLLCFGR_PLLN_0 (0x01UL << STM32_RCC_PLLCFGR_PLLN_POS)
#define STM32_RCC_PLLCFGR_PLLN_1 (0x02UL << STM32_RCC_PLLCFGR_PLLN_POS)
#define STM32_RCC_PLLCFGR_PLLN_2 (0x04UL << STM32_RCC_PLLCFGR_PLLN_POS)
#define STM32_RCC_PLLCFGR_PLLN_3 (0x08UL << STM32_RCC_PLLCFGR_PLLN_POS)
#define STM32_RCC_PLLCFGR_PLLN_4 (0x10UL << STM32_RCC_PLLCFGR_PLLN_POS)
#define STM32_RCC_PLLCFGR_PLLN_5 (0x20UL << STM32_RCC_PLLCFGR_PLLN_POS)
#define STM32_RCC_PLLCFGR_PLLN_6 (0x40UL << STM32_RCC_PLLCFGR_PLLN_POS)

#define STM32_RCC_PLLCFGR_PLLPEN_POS 16U
#define STM32_RCC_PLLCFGR_PLLPEN_MSK (0x1UL << STM32_RCC_PLLCFGR_PLLPEN_POS)
#define STM32_RCC_PLLCFGR_PLLPEN STM32_RCC_PLLCFGR_PLLPEN_MSK
#define STM32_RCC_PLLCFGR_PLLP_POS 17U
#define STM32_RCC_PLLCFGR_PLLP_MSK (0x1UL << STM32_RCC_PLLCFGR_PLLP_POS)
#define STM32_RCC_PLLCFGR_PLLP STM32_RCC_PLLCFGR_PLLP_MSK
#define STM32_RCC_PLLCFGR_PLLQEN_POS 20U
#define STM32_RCC_PLLCFGR_PLLQEN_MSK (0x1UL << STM32_RCC_PLLCFGR_PLLQEN_POS)
#define STM32_RCC_PLLCFGR_PLLQEN STM32_RCC_PLLCFGR_PLLQEN_MSK

#define STM32_RCC_PLLCFGR_PLLQ_POS 21U
#define STM32_RCC_PLLCFGR_PLLQ_MSK (0x3UL << STM32_RCC_PLLCFGR_PLLQ_POS)
#define STM32_RCC_PLLCFGR_PLLQ STM32_RCC_PLLCFGR_PLLQ_MSK
#define STM32_RCC_PLLCFGR_PLLQ_0 (0x1UL << STM32_RCC_PLLCFGR_PLLQ_POS)
#define STM32_RCC_PLLCFGR_PLLQ_1 (0x2UL << STM32_RCC_PLLCFGR_PLLQ_POS)

#define STM32_RCC_PLLCFGR_PLLREN_POS 24U
#define STM32_RCC_PLLCFGR_PLLREN_MSK (0x1UL << STM32_RCC_PLLCFGR_PLLREN_POS)
#define STM32_RCC_PLLCFGR_PLLREN STM32_RCC_PLLCFGR_PLLREN_MSK
#define STM32_RCC_PLLCFGR_PLLR_POS 25U
#define STM32_RCC_PLLCFGR_PLLR_MSK (0x3UL << STM32_RCC_PLLCFGR_PLLR_POS)
#define STM32_RCC_PLLCFGR_PLLR STM32_RCC_PLLCFGR_PLLR_MSK
#define STM32_RCC_PLLCFGR_PLLR_0 (0x1UL << STM32_RCC_PLLCFGR_PLLR_POS)
#define STM32_RCC_PLLCFGR_PLLR_1 (0x2UL << STM32_RCC_PLLCFGR_PLLR_POS)

#define STM32_RCC_PLLCFGR_PLLPDIV_POS 27U
#define STM32_RCC_PLLCFGR_PLLPDIV_MSK (0x1FUL << STM32_RCC_PLLCFGR_PLLPDIV_POS)
#define STM32_RCC_PLLCFGR_PLLPDIV STM32_RCC_PLLCFGR_PLLPDIV_MSK
#define STM32_RCC_PLLCFGR_PLLPDIV_0 (0x01UL << STM32_RCC_PLLCFGR_PLLPDIV_POS)
#define STM32_RCC_PLLCFGR_PLLPDIV_1 (0x02UL << STM32_RCC_PLLCFGR_PLLPDIV_POS)
#define STM32_RCC_PLLCFGR_PLLPDIV_2 (0x04UL << STM32_RCC_PLLCFGR_PLLPDIV_POS)
#define STM32_RCC_PLLCFGR_PLLPDIV_3 (0x08UL << STM32_RCC_PLLCFGR_PLLPDIV_POS)
#define STM32_RCC_PLLCFGR_PLLPDIV_4 (0x10UL << STM32_RCC_PLLCFGR_PLLPDIV_POS)

/****************  BIT DEFINITION FOR STM32_RCC_PLLSAI1CFGR REGISTER  ********/
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS 8U
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_MSK \
	(0x7FUL << STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N STM32_RCC_PLLSAI1CFGR_PLLSAI1N_MSK
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_0 \
	(0x01UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_1 \
	(0x02UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_2 \
	(0x04UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_3 \
	(0x08UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_4 \
	(0x10UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_5 \
	(0x20UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1N_6 \
	(0x40UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1N_POS)

#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PEN_POS 16U
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PEN_MSK \
	(0x1UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1PEN_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PEN STM32_RCC_PLLSAI1CFGR_PLLSAI1PEN_MSK
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1P_POS 17U
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1P_MSK \
	(0x1UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1P_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1P STM32_RCC_PLLSAI1CFGR_PLLSAI1P_MSK

