FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1QEN_POS 20U
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1QEN_MSK \
	(0x1UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1QEN_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1QEN STM32_RCC_PLLSAI1CFGR_PLLSAI1QEN_MSK
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1Q_POS 21U
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1Q_MSK \
	(0x3UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1Q_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1Q STM32_RCC_PLLSAI1CFGR_PLLSAI1Q_MSK
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1Q_0 \
	(0x1UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1Q_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1Q_1 \
	(0x2UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1Q_POS)

#define STM32_RCC_PLLSAI1CFGR_PLLSAI1REN_POS 24U
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1REN_MSK \
	(0x1UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1REN_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1REN STM32_RCC_PLLSAI1CFGR_PLLSAI1REN_MSK
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1R_POS 25U
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1R_MSK \
	(0x3UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1R_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1R STM32_RCC_PLLSAI1CFGR_PLLSAI1R_MSK
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1R_0 \
	(0x1UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1R_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1R_1 \
	(0x2UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1R_POS)

#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_POS 27U
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_MSK \
	(0x1FUL << STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_MSK
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_0 \
	(0x01UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_1 \
	(0x02UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_2 \
	(0x04UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_3 \
	(0x08UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_POS)
#define STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_4 \
	(0x10UL << STM32_RCC_PLLSAI1CFGR_PLLSAI1PDIV_POS)

/**************  BIT DEFINITION FOR STM32_RCC_CIER REGISTER  ******************/
#define STM32_RCC_CIER_LSIRDYIE_POS 0U
#define STM32_RCC_CIER_LSIRDYIE_MSK (0x1UL << STM32_RCC_CIER_LSIRDYIE_POS)
#define STM32_RCC_CIER_LSIRDYIE STM32_RCC_CIER_LSIRDYIE_MSK
#define STM32_RCC_CIER_LSERDYIE_POS 1U
#define STM32_RCC_CIER_LSERDYIE_MSK (0x1UL << STM32_RCC_CIER_LSERDYIE_POS)
#define STM32_RCC_CIER_LSERDYIE STM32_RCC_CIER_LSERDYIE_MSK
#define STM32_RCC_CIER_MSIRDYIE_POS 2U
#define STM32_RCC_CIER_MSIRDYIE_MSK (0x1UL << STM32_RCC_CIER_MSIRDYIE_POS)
#define STM32_RCC_CIER_MSIRDYIE STM32_RCC_CIER_MSIRDYIE_MSK
#define STM32_RCC_CIER_HSIRDYIE_POS 3U
#define STM32_RCC_CIER_HSIRDYIE_MSK (0x1UL << STM32_RCC_CIER_HSIRDYIE_POS)
#define STM32_RCC_CIER_HSIRDYIE STM32_RCC_CIER_HSIRDYIE_MSK
#define STM32_RCC_CIER_HSERDYIE_POS 4U
#define STM32_RCC_CIER_HSERDYIE_MSK (0x1UL << STM32_RCC_CIER_HSERDYIE_POS)
#define STM32_RCC_CIER_HSERDYIE STM32_RCC_CIER_HSERDYIE_MSK
#define STM32_RCC_CIER_PLLRDYIE_POS 5U
#define STM32_RCC_CIER_PLLRDYIE_MSK (0x1UL << STM32_RCC_CIER_PLLRDYIE_POS)
#define STM32_RCC_CIER_PLLRDYIE STM32_RCC_CIER_PLLRDYIE_MSK
#define STM32_RCC_CIER_PLLSAI1RDYIE_POS 6U
#define STM32_RCC_CIER_PLLSAI1RDYIE_MSK \
	(0x1UL << STM32_RCC_CIER_PLLSAI1RDYIE_POS)
#define STM32_RCC_CIER_PLLSAI1RDYIE STM32_RCC_CIER_PLLSAI1RDYIE_MSK
#define STM32_RCC_CIER_PLLSAI2RDYIE_POS 7U
#define STM32_RCC_CIER_PLLSAI2RDYIE_MSK \
	(0x1UL << STM32_RCC_CIER_PLLSAI2RDYIE_POS)
#define STM32_RCC_CIER_PLLSAI2RDYIE STM32_RCC_CIER_PLLSAI2RDYIE_MSK
#define STM32_RCC_CIER_HSI48RDYIE_POS 10U
#define STM32_RCC_CIER_HSI48RDYIE_MSK (0x1UL << STM32_RCC_CIER_HSI48RDYIE_POS)
#define STM32_RCC_CIER_HSI48RDYIE STM32_RCC_CIER_HSI48RDYIE_MSK

/**************  BIT DEFINITION FOR STM32_RCC_CIFR REGISTER  ******************/
#define STM32_RCC_CIFR_LSIRDYF_POS 0U
#define STM32_RCC_CIFR_LSIRDYF_MSK (0x1UL << STM32_RCC_CIFR_LSIRDYF_POS)
#define STM32_RCC_CIFR_LSIRDYF STM32_RCC_CIFR_LSIRDYF_MSK
#define STM32_RCC_CIFR_LSERDYF_POS 1U
#define STM32_RCC_CIFR_LSERDYF_MSK (0x1UL << STM32_RCC_CIFR_LSERDYF_POS)
#define STM32_RCC_CIFR_LSERDYF STM32_RCC_CIFR_LSERDYF_MSK
#define STM32_RCC_CIFR_MSIRDYF_POS 2U
#define STM32_RCC_CIFR_MSIRDYF_MSK (0x1UL << STM32_RCC_CIFR_MSIRDYF_POS)
#define STM32_RCC_CIFR_MSIRDYF STM32_RCC_CIFR_MSIRDYF_MSK
#define STM32_RCC_CIFR_HSIRDYF_POS 3U
#define STM32_RCC_CIFR_HSIRDYF_MSK (0x1UL << STM32_RCC_CIFR_HSIRDYF_POS)
#define STM32_RCC_CIFR_HSIRDYF STM32_RCC_CIFR_HSIRDYF_MSK
#define STM32_RCC_CIFR_HSERDYF_POS 4U
#define STM32_RCC_CIFR_HSERDYF_MSK (0x1UL << STM32_RCC_CIFR_HSERDYF_POS)
#define STM32_RCC_CIFR_HSERDYF STM32_RCC_CIFR_HSERDYF_MSK
#define STM32_RCC_CIFR_PLLRDYF_POS 5U
#define STM32_RCC_CIFR_PLLRDYF_MSK (0x1UL << STM32_RCC_CIFR_PLLRDYF_POS)
#define STM32_RCC_CIFR_PLLRDYF STM32_RCC_CIFR_PLLRDYF_MSK
#define STM32_RCC_CIFR_PLLSAI1RDYF_POS 6U
#define STM32_RCC_CIFR_PLLSAI1RDYF_MSK (0x1UL << STM32_RCC_CIFR_PLLSAI1RDYF_POS)
#define STM32_RCC_CIFR_PLLSAI1RDYF STM32_RCC_CIFR_PLLSAI1RDYF_MSK
#define STM32_RCC_CIFR_PLLSAI2RDYF_POS 7U
#define STM32_RCC_CIFR_PLLSAI2RDYF_MSK (0x1UL << STM32_RCC_CIFR_PLLSAI2RDYF_POS)
#define STM32_RCC_CIFR_PLLSAI2RDYF STM32_RCC_CIFR_PLLSAI2RDYF_MSK
#define STM32_RCC_CIFR_CSSF_POS 8U
#define STM32_RCC_CIFR_CSSF_MSK (0x1UL << STM32_RCC_CIFR_CSSF_POS)
#define STM32_RCC_CIFR_CSSF STM32_RCC_CIFR_CSSF_MSK
#define STM32_RCC_CIFR_HSI48RDYF_POS 10U
#define STM32_RCC_CIFR_HSI48RDYF_MSK (0x1UL << STM32_RCC_CIFR_HSI48RDYF_POS)
#define STM32_RCC_CIFR_HSI48RDYF STM32_RCC_CIFR_HSI48RDYF_MSK

/**************  BIT DEFINITION FOR STM32_RCC_CICR REGISTER  ******************/
#define STM32_RCC_CICR_LSIRDYC_POS 0U
#define STM32_RCC_CICR_LSIRDYC_MSK (0x1UL << STM32_RCC_CICR_LSIRDYC_POS)
#define STM32_RCC_CICR_LSIRDYC STM32_RCC_CICR_LSIRDYC_MSK
#define STM32_RCC_CICR_LSERDYC_POS 1U
#define STM32_RCC_CICR_LSERDYC_MSK (0x1UL << STM32_RCC_CICR_LSERDYC_POS)
#define STM32_RCC_CICR_LSERDYC STM32_RCC_CICR_LSERDYC_MSK
#define STM32_RCC_CICR_MSIRDYC_POS 2U
#define STM32_RCC_CICR_MSIRDYC_MSK (0x1UL << STM32_RCC_CICR_MSIRDYC_POS)
#define STM32_RCC_CICR_MSIRDYC STM32_RCC_CICR_MSIRDYC_MSK
#define STM32_RCC_CICR_HSIRDYC_POS 3U
#define STM32_RCC_CICR_HSIRDYC_MSK (0x1UL << STM32_RCC_CICR_HSIRDYC_POS)
#define STM32_RCC_CICR_HSIRDYC STM32_RCC_CICR_HSIRDYC_MSK
#define STM32_RCC_CICR_HSERDYC_POS 4U
#define STM32_RCC_CICR_HSERDYC_MSK (0x1UL << STM32_RCC_CICR_HSERDYC_POS)
#define STM32_RCC_CICR_HSERDYC STM32_RCC_CICR_HSERDYC_MSK
#define STM32_RCC_CICR_PLLRDYC_POS 5U
#define STM32_RCC_CICR_PLLRDYC_MSK (0x1UL << STM32_RCC_CICR_PLLRDYC_POS)
#define STM32_RCC_CICR_PLLRDYC STM32_RCC_CICR_PLLRDYC_MSK
#define STM32_RCC_CICR_PLLSAI1RDYC_POS 6U
#define STM32_RCC_CICR_PLLSAI1RDYC_MSK (0x1UL << STM32_RCC_CICR_PLLSAI1RDYC_POS)
#define STM32_RCC_CICR_PLLSAI1RDYC STM32_RCC_CICR_PLLSAI1RDYC_MSK
#define STM32_RCC_CICR_PLLSAI2RDYC_POS 7U
#define STM32_RCC_CICR_PLLSAI2RDYC_MSK (0x1UL << STM32_RCC_CICR_PLLSAI2RDYC_POS)
#define STM32_RCC_CICR_PLLSAI2RDYC STM32_RCC_CICR_PLLSAI2RDYC_MSK
#define STM32_RCC_CICR_CSSC_POS 8U
#define STM32_RCC_CICR_CSSC_MSK (0x1UL << STM32_RCC_CICR_CSSC_POS)
#define STM32_RCC_CICR_CSSC STM32_RCC_CICR_CSSC_MSK
#define STM32_RCC_CICR_HSI48RDYC_POS 10U
#define STM32_RCC_CICR_HSI48RDYC_MSK (0x1UL << STM32_RCC_CICR_HSI48RDYC_POS)
#define STM32_RCC_CICR_HSI48RDYC STM32_RCC_CICR_HSI48RDYC_MSK

/**************  BIT DEFINITION FOR STM32_RCC_AHB1RSTR REGISTER  **************/
#define STM32_RCC_AHB1RSTR_DMA1RST_POS 0U
#define STM32_RCC_AHB1RSTR_DMA1RST_MSK (0x1UL << STM32_RCC_AHB1RSTR_DMA1RST_POS)
#define STM32_RCC_AHB1RSTR_DMA1RST STM32_RCC_AHB1RSTR_DMA1RST_MSK
#define STM32_RCC_AHB1RSTR_DMA2RST_POS 1U
#define STM32_RCC_AHB1RSTR_DMA2RST_MSK (0x1UL << STM32_RCC_AHB1RSTR_DMA2RST_POS)
#define STM32_RCC_AHB1RSTR_DMA2RST STM32_RCC_AHB1RSTR_DMA2RST_MSK
#define STM32_RCC_AHB1RSTR_DMAMUX1RST_POS 2U
#define STM32_RCC_AHB1RSTR_DMAMUX1RST_MSK \
	(0x1UL << STM32_RCC_AHB1RSTR_DMAMUX1RST_POS)
#define STM32_RCC_AHB1RSTR_DMAMUX1RST STM32_RCC_AHB1RSTR_DMAMUX1RST_MSK
#define STM32_RCC_AHB1RSTR_FLASHRST_POS 8U
#define STM32_RCC_AHB1RSTR_FLASHRST_MSK \
	(0x1UL << STM32_RCC_AHB1RSTR_FLASHRST_POS)
#define STM32_RCC_AHB1RSTR_FLASHRST STM32_RCC_AHB1RSTR_FLASHRST_MSK
#define STM32_RCC_AHB1RSTR_CRCRST_POS 12U
#define STM32_RCC_AHB1RSTR_CRCRST_MSK (0x1UL << STM32_RCC_AHB1RSTR_CRCRST_POS)
#define STM32_RCC_AHB1RSTR_CRCRST STM32_RCC_AHB1RSTR_CRCRST_MSK
#define STM32_RCC_AHB1RSTR_TSCRST_POS 16U
#define STM32_RCC_AHB1RSTR_TSCRST_MSK (0x1UL << STM32_RCC_AHB1RSTR_TSCRST_POS)
#define STM32_RCC_AHB1RSTR_TSCRST STM32_RCC_AHB1RSTR_TSCRST_MSK

/**************  BIT DEFINITION FOR STM32_RCC_AHB2RSTR REGISTER  **************/
#define STM32_RCC_AHB2RSTR_GPIOARST_POS 0U
#define STM32_RCC_AHB2RSTR_GPIOARST_MSK \
	(0x1UL << STM32_RCC_AHB2RSTR_GPIOARST_POS)
#define STM32_RCC_AHB2RSTR_GPIOARST STM32_RCC_AHB2RSTR_GPIOARST_MSK
#define STM32_RCC_AHB2RSTR_GPIOBRST_POS 1U
#define STM32_RCC_AHB2RSTR_GPIOBRST_MSK \
	(0x1UL << STM32_RCC_AHB2RSTR_GPIOBRST_POS)
#define STM32_RCC_AHB2RSTR_GPIOBRST STM32_RCC_AHB2RSTR_GPIOBRST_MSK
#define STM32_RCC_AHB2RSTR_GPIOCRST_POS 2U
#define STM32_RCC_AHB2RSTR_GPIOCRST_MSK \
	(0x1UL << STM32_RCC_AHB2RSTR_GPIOCRST_POS)
#define STM32_RCC_AHB2RSTR_GPIOCRST STM32_RCC_AHB2RSTR_GPIOCRST_MSK
#define STM32_RCC_AHB2RSTR_GPIODRST_POS 3U
#define STM32_RCC_AHB2RSTR_GPIODRST_MSK \
	(0x1UL << STM32_RCC_AHB2RSTR_GPIODRST_POS)
#define STM32_RCC_AHB2RSTR_GPIODRST STM32_RCC_AHB2RSTR_GPIODRST_MSK
#define STM32_RCC_AHB2RSTR_GPIOERST_POS 4U
#define STM32_RCC_AHB2RSTR_GPIOERST_MSK \
	(0x1UL << STM32_RCC_AHB2RSTR_GPIOERST_POS)
#define STM32_RCC_AHB2RSTR_GPIOERST STM32_RCC_AHB2RSTR_GPIOERST_MSK
#define STM32_RCC_AHB2RSTR_GPIOFRST_POS 5U
#define STM32_RCC_AHB2RSTR_GPIOFRST_MSK \
	(0x1UL << STM32_RCC_AHB2RSTR_GPIOFRST_POS)
#define STM32_RCC_AHB2RSTR_GPIOFRST STM32_RCC_AHB2RSTR_GPIOFRST_MSK
#define STM32_RCC_AHB2RSTR_GPIOGRST_POS 6U
#define STM32_RCC_AHB2RSTR_GPIOGRST_MSK \
	(0x1UL << STM32_RCC_AHB2RSTR_GPIOGRST_POS)
#define STM32_RCC_AHB2RSTR_GPIOGRST STM32_RCC_AHB2RSTR_GPIOGRST_MSK
#define STM32_RCC_AHB2RSTR_GPIOHRST_POS 7U
#define STM32_RCC_AHB2RSTR_GPIOHRST_MSK \
	(0x1UL << STM32_RCC_AHB2RSTR_GPIOHRST_POS)
#define STM32_RCC_AHB2RSTR_GPIOHRST STM32_RCC_AHB2RSTR_GPIOHRST_MSK
#define STM32_RCC_AHB2RSTR_ADCRST_POS 13U
#define STM32_RCC_AHB2RSTR_ADCRST_MSK (0x1UL << STM32_RCC_AHB2RSTR_ADCRST_POS)
#define STM32_RCC_AHB2RSTR_ADCRST STM32_RCC_AHB2RSTR_ADCRST_MSK
#define STM32_RCC_AHB2RSTR_AESRST_POS 16U
#define STM32_RCC_AHB2RSTR_AESRST_MSK (0x1UL << STM32_RCC_AHB2RSTR_AESRST_POS)
#define STM32_RCC_AHB2RSTR_AESRST STM32_RCC_AHB2RSTR_AESRST_MSK
#define STM32_RCC_AHB2RSTR_HASHRST_POS 17U
#define STM32_RCC_AHB2RSTR_HASHRST_MSK (0x1UL << STM32_RCC_AHB2RSTR_HASHRST_POS)
#define STM32_RCC_AHB2RSTR_HASHRST STM32_RCC_AHB2RSTR_HASHRST_MSK
#define STM32_RCC_AHB2RSTR_RNGRST_POS 18U
#define STM32_RCC_AHB2RSTR_RNGRST_MSK (0x1UL << STM32_RCC_AHB2RSTR_RNGRST_POS)
#define STM32_RCC_AHB2RSTR_RNGRST STM32_RCC_AHB2RSTR_RNGRST_MSK

