FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
/*************  BIT DEFINITION FOR STM32_RCC_AHB3RSTR REGISTER  **************/
#define STM32_RCC_AHB3RSTR_FMCRST_POS 0U
#define STM32_RCC_AHB3RSTR_FMCRST_MSK (0x1UL << STM32_RCC_AHB3RSTR_FMCRST_POS)
#define STM32_RCC_AHB3RSTR_FMCRST STM32_RCC_AHB3RSTR_FMCRST_MSK
#define STM32_RCC_AHB3RSTR_QSPIRST_POS 8U
#define STM32_RCC_AHB3RSTR_QSPIRST_MSK (0x1UL << STM32_RCC_AHB3RSTR_QSPIRST_POS)
#define STM32_RCC_AHB3RSTR_QSPIRST STM32_RCC_AHB3RSTR_QSPIRST_MSK

/*************  BIT DEFINITION FOR STM32_RCC_APB1RSTR1 REGISTER  **************/
#define STM32_RCC_APB1RSTR1_TIM2RST_POS 0U
#define STM32_RCC_APB1RSTR1_TIM2RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_TIM2RST_POS)
#define STM32_RCC_APB1RSTR1_TIM2RST STM32_RCC_APB1RSTR1_TIM2RST_MSK
#define STM32_RCC_APB1RSTR1_TIM3RST_POS 1U
#define STM32_RCC_APB1RSTR1_TIM3RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_TIM3RST_POS)
#define STM32_RCC_APB1RSTR1_TIM3RST STM32_RCC_APB1RSTR1_TIM3RST_MSK
#define STM32_RCC_APB1RSTR1_TIM4RST_POS 2U
#define STM32_RCC_APB1RSTR1_TIM4RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_TIM4RST_POS)
#define STM32_RCC_APB1RSTR1_TIM4RST STM32_RCC_APB1RSTR1_TIM4RST_MSK
#define STM32_RCC_APB1RSTR1_TIM5RST_POS 3U
#define STM32_RCC_APB1RSTR1_TIM5RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_TIM5RST_POS)
#define STM32_RCC_APB1RSTR1_TIM5RST STM32_RCC_APB1RSTR1_TIM5RST_MSK
#define STM32_RCC_APB1RSTR1_TIM6RST_POS 4U
#define STM32_RCC_APB1RSTR1_TIM6RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_TIM6RST_POS)
#define STM32_RCC_APB1RSTR1_TIM6RST STM32_RCC_APB1RSTR1_TIM6RST_MSK
#define STM32_RCC_APB1RSTR1_TIM7RST_POS 5U
#define STM32_RCC_APB1RSTR1_TIM7RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_TIM7RST_POS)
#define STM32_RCC_APB1RSTR1_TIM7RST STM32_RCC_APB1RSTR1_TIM7RST_MSK
#define STM32_RCC_APB1RSTR1_SPI2RST_POS 14U
#define STM32_RCC_APB1RSTR1_SPI2RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_SPI2RST_POS)
#define STM32_RCC_APB1RSTR1_SPI2RST STM32_RCC_APB1RSTR1_SPI2RST_MSK
#define STM32_RCC_APB1RSTR1_SPI3RST_POS 15U
#define STM32_RCC_APB1RSTR1_SPI3RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_SPI3RST_POS)
#define STM32_RCC_APB1RSTR1_SPI3RST STM32_RCC_APB1RSTR1_SPI3RST_MSK
#define STM32_RCC_APB1RSTR1_USART2RST_POS 17U
#define STM32_RCC_APB1RSTR1_USART2RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_USART2RST_POS)
#define STM32_RCC_APB1RSTR1_USART2RST STM32_RCC_APB1RSTR1_USART2RST_MSK
#define STM32_RCC_APB1RSTR1_USART3RST_POS 18U
#define STM32_RCC_APB1RSTR1_USART3RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_USART3RST_POS)
#define STM32_RCC_APB1RSTR1_USART3RST STM32_RCC_APB1RSTR1_USART3RST_MSK
#define STM32_RCC_APB1RSTR1_USART4RST_POS 19U
#define STM32_RCC_APB1RSTR1_USART4RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_USART4RST_POS)
#define STM32_RCC_APB1RSTR1_USART4RST STM32_RCC_APB1RSTR1_USART4RST_MSK
#define STM32_RCC_APB1RSTR1_USART5RST_POS 20U
#define STM32_RCC_APB1RSTR1_USART5RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_USART5RST_POS)
#define STM32_RCC_APB1RSTR1_USART5RST STM32_RCC_APB1RSTR1_USART5RST_MSK
#define STM32_RCC_APB1RSTR1_I2C1RST_POS 21U
#define STM32_RCC_APB1RSTR1_I2C1RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_I2C1RST_POS)
#define STM32_RCC_APB1RSTR1_I2C1RST STM32_RCC_APB1RSTR1_I2C1RST_MSK
#define STM32_RCC_APB1RSTR1_I2C2RST_POS 22U
#define STM32_RCC_APB1RSTR1_I2C2RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_I2C2RST_POS)
#define STM32_RCC_APB1RSTR1_I2C2RST STM32_RCC_APB1RSTR1_I2C2RST_MSK
#define STM32_RCC_APB1RSTR1_I2C3RST_POS 23U
#define STM32_RCC_APB1RSTR1_I2C3RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_I2C3RST_POS)
#define STM32_RCC_APB1RSTR1_I2C3RST STM32_RCC_APB1RSTR1_I2C3RST_MSK
#define STM32_RCC_APB1RSTR1_CRSRST_POS 24U
#define STM32_RCC_APB1RSTR1_CRSRST_MSK (0x1UL << STM32_RCC_APB1RSTR1_CRSRST_POS)
#define STM32_RCC_APB1RSTR1_CRSRST STM32_RCC_APB1RSTR1_CRSRST_MSK
#define STM32_RCC_APB1RSTR1_PWRRST_POS 28U
#define STM32_RCC_APB1RSTR1_PWRRST_MSK (0x1UL << STM32_RCC_APB1RSTR1_PWRRST_POS)
#define STM32_RCC_APB1RSTR1_PWRRST STM32_RCC_APB1RSTR1_PWRRST_MSK
#define STM32_RCC_APB1RSTR1_DAC1RST_POS 29U
#define STM32_RCC_APB1RSTR1_DAC1RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_DAC1RST_POS)
#define STM32_RCC_APB1RSTR1_DAC1RST STM32_RCC_APB1RSTR1_DAC1RST_MSK
#define STM32_RCC_APB1RSTR1_OPAMPRST_POS 30U
#define STM32_RCC_APB1RSTR1_OPAMPRST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_OPAMPRST_POS)
#define STM32_RCC_APB1RSTR1_OPAMPRST STM32_RCC_APB1RSTR1_OPAMPRST_MSK
#define STM32_RCC_APB1RSTR1_LPTIM1RST_POS 31U
#define STM32_RCC_APB1RSTR1_LPTIM1RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR1_LPTIM1RST_POS)
#define STM32_RCC_APB1RSTR1_LPTIM1RST STM32_RCC_APB1RSTR1_LPTIM1RST_MSK

/*************  BIT DEFINITION FOR STM32_RCC_APB1RSTR2 REGISTER  **************/
#define STM32_RCC_APB1RSTR2_LPUART1RST_POS 0U
#define STM32_RCC_APB1RSTR2_LPUART1RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR2_LPUART1RST_POS)
#define STM32_RCC_APB1RSTR2_LPUART1RST STM32_RCC_APB1RSTR2_LPUART1RST_MSK
#define STM32_RCC_APB1RSTR2_I2C4RST_POS 1U
#define STM32_RCC_APB1RSTR2_I2C4RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR2_I2C4RST_POS)
#define STM32_RCC_APB1RSTR2_I2C4RST STM32_RCC_APB1RSTR2_I2C4RST_MSK
#define STM32_RCC_APB1RSTR2_LPTIM2RST_POS 5U
#define STM32_RCC_APB1RSTR2_LPTIM2RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR2_LPTIM2RST_POS)
#define STM32_RCC_APB1RSTR2_LPTIM2RST STM32_RCC_APB1RSTR2_LPTIM2RST_MSK
#define STM32_RCC_APB1RSTR2_LPTIM3RST_POS 6U
#define STM32_RCC_APB1RSTR2_LPTIM3RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR2_LPTIM3RST_POS)
#define STM32_RCC_APB1RSTR2_LPTIM3RST STM32_RCC_APB1RSTR2_LPTIM3RST_MSK
#define STM32_RCC_APB1RSTR2_FDCAN1RST_POS 9U
#define STM32_RCC_APB1RSTR2_FDCAN1RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR2_FDCAN1RST_POS)
#define STM32_RCC_APB1RSTR2_FDCAN1RST STM32_RCC_APB1RSTR2_FDCAN1RST_MSK
#define STM32_RCC_APB1RSTR2_USBFSRST_POS 21U
#define STM32_RCC_APB1RSTR2_USBFSRST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR2_USBFSRST_POS)
#define STM32_RCC_APB1RSTR2_USBFSRST STM32_RCC_APB1RSTR2_USBFSRST_MSK
#define STM32_RCC_APB1RSTR2_UCPD1RST_POS 23U
#define STM32_RCC_APB1RSTR2_UCPD1RST_MSK \
	(0x1UL << STM32_RCC_APB1RSTR2_UCPD1RST_POS)
#define STM32_RCC_APB1RSTR2_UCPD1RST STM32_RCC_APB1RSTR2_UCPD1RST_MSK

/**************  BIT DEFINITION FOR STM32_RCC_APB2RSTR REGISTER  **************/
#define STM32_RCC_APB2RSTR_SYSCFGRST_POS 0U
#define STM32_RCC_APB2RSTR_SYSCFGRST_MSK \
	(0x1UL << STM32_RCC_APB2RSTR_SYSCFGRST_POS)
#define STM32_RCC_APB2RSTR_SYSCFGRST STM32_RCC_APB2RSTR_SYSCFGRST_MSK
#define STM32_RCC_APB2RSTR_TIM1RST_POS 11U
#define STM32_RCC_APB2RSTR_TIM1RST_MSK (0x1UL << STM32_RCC_APB2RSTR_TIM1RST_POS)
#define STM32_RCC_APB2RSTR_TIM1RST STM32_RCC_APB2RSTR_TIM1RST_MSK
#define STM32_RCC_APB2RSTR_SPI1RST_POS 12U
#define STM32_RCC_APB2RSTR_SPI1RST_MSK (0x1UL << STM32_RCC_APB2RSTR_SPI1RST_POS)
#define STM32_RCC_APB2RSTR_SPI1RST STM32_RCC_APB2RSTR_SPI1RST_MSK
#define STM32_RCC_APB2RSTR_TIM8RST_POS 13U
#define STM32_RCC_APB2RSTR_TIM8RST_MSK (0x1UL << STM32_RCC_APB2RSTR_TIM8RST_POS)
#define STM32_RCC_APB2RSTR_TIM8RST STM32_RCC_APB2RSTR_TIM8RST_MSK
#define STM32_RCC_APB2RSTR_USART1RST_POS 14U
#define STM32_RCC_APB2RSTR_USART1RST_MSK \
	(0x1UL << STM32_RCC_APB2RSTR_USART1RST_POS)
#define STM32_RCC_APB2RSTR_USART1RST STM32_RCC_APB2RSTR_USART1RST_MSK
#define STM32_RCC_APB2RSTR_TIM15RST_POS 16U
#define STM32_RCC_APB2RSTR_TIM15RST_MSK \
	(0x1UL << STM32_RCC_APB2RSTR_TIM15RST_POS)
#define STM32_RCC_APB2RSTR_TIM15RST STM32_RCC_APB2RSTR_TIM15RST_MSK
#define STM32_RCC_APB2RSTR_TIM16RST_POS 17U
#define STM32_RCC_APB2RSTR_TIM16RST_MSK \
	(0x1UL << STM32_RCC_APB2RSTR_TIM16RST_POS)
#define STM32_RCC_APB2RSTR_TIM16RST STM32_RCC_APB2RSTR_TIM16RST_MSK
#define STM32_RCC_APB2RSTR_TIM17RST_POS 18U
#define STM32_RCC_APB2RSTR_TIM17RST_MSK \
	(0x1UL << STM32_RCC_APB2RSTR_TIM17RST_POS)
#define STM32_RCC_APB2RSTR_TIM17RST STM32_RCC_APB2RSTR_TIM17RST_MSK
#define STM32_RCC_APB2RSTR_SAI1RST_POS 21U
#define STM32_RCC_APB2RSTR_SAI1RST_MSK (0x1UL << STM32_RCC_APB2RSTR_SAI1RST_POS)
#define STM32_RCC_APB2RSTR_SAI1RST STM32_RCC_APB2RSTR_SAI1RST_MSK
#define STM32_RCC_APB2RSTR_SAI2RST_POS 22U
#define STM32_RCC_APB2RSTR_SAI2RST_MSK (0x1UL << STM32_RCC_APB2RSTR_SAI2RST_POS)
#define STM32_RCC_APB2RSTR_SAI2RST STM32_RCC_APB2RSTR_SAI2RST_MSK
#define STM32_RCC_APB2RSTR_DFSDM1RST_POS 24U
#define STM32_RCC_APB2RSTR_DFSDM1RST_MSK \
	(0x1UL << STM32_RCC_APB2RSTR_DFSDM1RST_POS)
#define STM32_RCC_APB2RSTR_DFSDM1RST STM32_RCC_APB2RSTR_DFSDM1RST_MSK

