FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
/**************  BIT DEFINITION FOR STM32_RCC_APB2ENR REGISTER  ***************/
#define STM32_RCC_APB2ENR_SYSCFGEN_POS 0U
#define STM32_RCC_APB2ENR_SYSCFGEN_MSK (0x1UL << STM32_RCC_APB2ENR_SYSCFGEN_POS)
#define STM32_RCC_APB2ENR_SYSCFGEN STM32_RCC_APB2ENR_SYSCFGEN_MSK
#define STM32_RCC_APB2ENR_TIM1EN_POS 11U
#define STM32_RCC_APB2ENR_TIM1EN_MSK (0x1UL << STM32_RCC_APB2ENR_TIM1EN_POS)
#define STM32_RCC_APB2ENR_TIM1EN STM32_RCC_APB2ENR_TIM1EN_MSK
#define STM32_RCC_APB2ENR_SPI1EN_POS 12U
#define STM32_RCC_APB2ENR_SPI1EN_MSK (0x1UL << STM32_RCC_APB2ENR_SPI1EN_POS)
#define STM32_RCC_APB2ENR_SPI1EN STM32_RCC_APB2ENR_SPI1EN_MSK
#define STM32_RCC_APB2ENR_TIM8EN_POS 13U
#define STM32_RCC_APB2ENR_TIM8EN_MSK (0x1UL << STM32_RCC_APB2ENR_TIM8EN_POS)
#define STM32_RCC_APB2ENR_TIM8EN STM32_RCC_APB2ENR_TIM8EN_MSK
#define STM32_RCC_APB2ENR_USART1EN_POS 14U
#define STM32_RCC_APB2ENR_USART1EN_MSK (0x1UL << STM32_RCC_APB2ENR_USART1EN_POS)
#define STM32_RCC_APB2ENR_USART1EN STM32_RCC_APB2ENR_USART1EN_MSK
#define STM32_RCC_APB2ENR_TIM15EN_POS 16U
#define STM32_RCC_APB2ENR_TIM15EN_MSK (0x1UL << STM32_RCC_APB2ENR_TIM15EN_POS)
#define STM32_RCC_APB2ENR_TIM15EN STM32_RCC_APB2ENR_TIM15EN_MSK
#define STM32_RCC_APB2ENR_TIM16EN_POS 17U
#define STM32_RCC_APB2ENR_TIM16EN_MSK (0x1UL << STM32_RCC_APB2ENR_TIM16EN_POS)
#define STM32_RCC_APB2ENR_TIM16EN STM32_RCC_APB2ENR_TIM16EN_MSK
#define STM32_RCC_APB2ENR_TIM17EN_POS 18U
#define STM32_RCC_APB2ENR_TIM17EN_MSK (0x1UL << STM32_RCC_APB2ENR_TIM17EN_POS)
#define STM32_RCC_APB2ENR_TIM17EN STM32_RCC_APB2ENR_TIM17EN_MSK
#define STM32_RCC_APB2ENR_SAI1EN_POS 21U
#define STM32_RCC_APB2ENR_SAI1EN_MSK (0x1UL << STM32_RCC_APB2ENR_SAI1EN_POS)
#define STM32_RCC_APB2ENR_SAI1EN STM32_RCC_APB2ENR_SAI1EN_MSK
#define STM32_RCC_APB2ENR_SAI2EN_POS 22U
#define STM32_RCC_APB2ENR_SAI2EN_MSK (0x1UL << STM32_RCC_APB2ENR_SAI2EN_POS)
#define STM32_RCC_APB2ENR_SAI2EN STM32_RCC_APB2ENR_SAI2EN_MSK
#define STM32_RCC_APB2ENR_DFSDM1EN_POS 24U
#define STM32_RCC_APB2ENR_DFSDM1EN_MSK (0x1UL << STM32_RCC_APB2ENR_DFSDM1EN_POS)
#define STM32_RCC_APB2ENR_DFSDM1EN STM32_RCC_APB2ENR_DFSDM1EN_MSK

/************  BIT DEFINITION FOR STM32_RCC_AHB1SMENR REGISTER  ***************/
#define STM32_RCC_AHB1SMENR_DMA1SMEN_POS 0U
#define STM32_RCC_AHB1SMENR_DMA1SMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_DMA1SMEN_POS)
#define STM32_RCC_AHB1SMENR_DMA1SMEN STM32_RCC_AHB1SMENR_DMA1SMEN_MSK
#define STM32_RCC_AHB1SMENR_DMA2SMEN_POS 1U
#define STM32_RCC_AHB1SMENR_DMA2SMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_DMA2SMEN_POS)
#define STM32_RCC_AHB1SMENR_DMA2SMEN STM32_RCC_AHB1SMENR_DMA2SMEN_MSK
#define STM32_RCC_AHB1SMENR_DMAMUX1SMEN_POS 2U
#define STM32_RCC_AHB1SMENR_DMAMUX1SMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_DMAMUX1SMEN_POS)
#define STM32_RCC_AHB1SMENR_DMAMUX1SMEN STM32_RCC_AHB1SMENR_DMAMUX1SMEN_MSK
#define STM32_RCC_AHB1SMENR_FLASHSMEN_POS 8U
#define STM32_RCC_AHB1SMENR_FLASHSMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_FLASHSMEN_POS)
#define STM32_RCC_AHB1SMENR_FLASHSMEN STM32_RCC_AHB1SMENR_FLASHSMEN_MSK
#define STM32_RCC_AHB1SMENR_SRAM1SMEN_POS 9U
#define STM32_RCC_AHB1SMENR_SRAM1SMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_SRAM1SMEN_POS)
#define STM32_RCC_AHB1SMENR_SRAM1SMEN STM32_RCC_AHB1SMENR_SRAM1SMEN_MSK
#define STM32_RCC_AHB1SMENR_CRCSMEN_POS 12U
#define STM32_RCC_AHB1SMENR_CRCSMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_CRCSMEN_POS)
#define STM32_RCC_AHB1SMENR_CRCSMEN STM32_RCC_AHB1SMENR_CRCSMEN_MSK
#define STM32_RCC_AHB1SMENR_TSCSMEN_POS 16U
#define STM32_RCC_AHB1SMENR_TSCSMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_TSCSMEN_POS)
#define STM32_RCC_AHB1SMENR_TSCSMEN STM32_RCC_AHB1SMENR_TSCSMEN_MSK
#define STM32_RCC_AHB1SMENR_GTZCSMEN_POS 22U
#define STM32_RCC_AHB1SMENR_GTZCSMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_GTZCSMEN_POS)
#define STM32_RCC_AHB1SMENR_GTZCSMEN STM32_RCC_AHB1SMENR_GTZCSMEN_MSK
#define STM32_RCC_AHB1SMENR_ICACHESMEN_POS 23U
#define STM32_RCC_AHB1SMENR_ICACHESMEN_MSK \
	(0x1UL << STM32_RCC_AHB1SMENR_ICACHESMEN_POS)
#define STM32_RCC_AHB1SMENR_ICACHESMEN STM32_RCC_AHB1SMENR_ICACHESMEN_MSK

/**************  BIT DEFINITION FOR STM32_RCC_AHB2SMENR REGISTER  *************/
#define STM32_RCC_AHB2SMENR_GPIOASMEN_POS 0U
#define STM32_RCC_AHB2SMENR_GPIOASMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_GPIOASMEN_POS)
#define STM32_RCC_AHB2SMENR_GPIOASMEN STM32_RCC_AHB2SMENR_GPIOASMEN_MSK
#define STM32_RCC_AHB2SMENR_GPIOBSMEN_POS 1U
#define STM32_RCC_AHB2SMENR_GPIOBSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_GPIOBSMEN_POS)
#define STM32_RCC_AHB2SMENR_GPIOBSMEN STM32_RCC_AHB2SMENR_GPIOBSMEN_MSK
#define STM32_RCC_AHB2SMENR_GPIOCSMEN_POS 2U
#define STM32_RCC_AHB2SMENR_GPIOCSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_GPIOCSMEN_POS)
#define STM32_RCC_AHB2SMENR_GPIOCSMEN STM32_RCC_AHB2SMENR_GPIOCSMEN_MSK
#define STM32_RCC_AHB2SMENR_GPIODSMEN_POS 3U
#define STM32_RCC_AHB2SMENR_GPIODSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_GPIODSMEN_POS)
#define STM32_RCC_AHB2SMENR_GPIODSMEN STM32_RCC_AHB2SMENR_GPIODSMEN_MSK
#define STM32_RCC_AHB2SMENR_GPIOESMEN_POS 4U
#define STM32_RCC_AHB2SMENR_GPIOESMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_GPIOESMEN_POS)
#define STM32_RCC_AHB2SMENR_GPIOESMEN STM32_RCC_AHB2SMENR_GPIOESMEN_MSK
#define STM32_RCC_AHB2SMENR_GPIOFSMEN_POS 5U
#define STM32_RCC_AHB2SMENR_GPIOFSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_GPIOFSMEN_POS)
#define STM32_RCC_AHB2SMENR_GPIOFSMEN STM32_RCC_AHB2SMENR_GPIOFSMEN_MSK
#define STM32_RCC_AHB2SMENR_GPIOGSMEN_POS 6U
#define STM32_RCC_AHB2SMENR_GPIOGSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_GPIOGSMEN_POS)
#define STM32_RCC_AHB2SMENR_GPIOGSMEN STM32_RCC_AHB2SMENR_GPIOGSMEN_MSK
#define STM32_RCC_AHB2SMENR_GPIOHSMEN_POS 7U
#define STM32_RCC_AHB2SMENR_GPIOHSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_GPIOHSMEN_POS)
#define STM32_RCC_AHB2SMENR_GPIOHSMEN STM32_RCC_AHB2SMENR_GPIOHSMEN_MSK
#define STM32_RCC_AHB2SMENR_SRAM2SMEN_POS 9U
#define STM32_RCC_AHB2SMENR_SRAM2SMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_SRAM2SMEN_POS)
#define STM32_RCC_AHB2SMENR_SRAM2SMEN STM32_RCC_AHB2SMENR_SRAM2SMEN_MSK
#define STM32_RCC_AHB2SMENR_ADCSMEN_POS 13U
#define STM32_RCC_AHB2SMENR_ADCSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_ADCSMEN_POS)
#define STM32_RCC_AHB2SMENR_ADCSMEN STM32_RCC_AHB2SMENR_ADCSMEN_MSK
#define STM32_RCC_AHB2SMENR_AESSMEN_POS 16U
#define STM32_RCC_AHB2SMENR_AESSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_AESSMEN_POS)
#define STM32_RCC_AHB2SMENR_AESSMEN STM32_RCC_AHB2SMENR_AESSMEN_MSK
#define STM32_RCC_AHB2SMENR_HASHSMEN_POS 17U
#define STM32_RCC_AHB2SMENR_HASHSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_HASHSMEN_POS)
#define STM32_RCC_AHB2SMENR_HASHSMEN STM32_RCC_AHB2SMENR_HASHSMEN_MSK
#define STM32_RCC_AHB2SMENR_RNGSMEN_POS 18U
#define STM32_RCC_AHB2SMENR_RNGSMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_RNGSMEN_POS)
#define STM32_RCC_AHB2SMENR_RNGSMEN STM32_RCC_AHB2SMENR_RNGSMEN_MSK
#define STM32_RCC_AHB2SMENR_PKASMEN_POS 19U
#define STM32_RCC_AHB2SMENR_PKASMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_PKASMEN_POS)
#define STM32_RCC_AHB2SMENR_PKASMEN STM32_RCC_AHB2SMENR_PKASMEN_MSK
#define STM32_RCC_AHB2SMENR_OTFDEC1SMEN_POS 21U
#define STM32_RCC_AHB2SMENR_OTFDEC1SMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_OTFDEC1SMEN_POS)
#define STM32_RCC_AHB2SMENR_OTFDEC1SMEN STM32_RCC_AHB2SMENR_OTFDEC1SMEN_MSK
#define STM32_RCC_AHB2SMENR_SDMMC1SMEN_POS 22U
#define STM32_RCC_AHB2SMENR_SDMMC1SMEN_MSK \
	(0x1UL << STM32_RCC_AHB2SMENR_SDMMC1SMEN_POS)
#define STM32_RCC_AHB2SMENR_SDMMC1SMEN STM32_RCC_AHB2SMENR_SDMMC1SMEN_MSK

/**************  BIT DEFINITION FOR STM32_RCC_AHB3SMENR REGISTER  *************/
#define STM32_RCC_AHB3SMENR_FMCSMEN_POS 0U
#define STM32_RCC_AHB3SMENR_FMCSMEN_MSK \
	(0x1UL << STM32_RCC_AHB3SMENR_FMCSMEN_POS)
#define STM32_RCC_AHB3SMENR_FMCSMEN STM32_RCC_AHB3SMENR_FMCSMEN_MSK
#define STM32_RCC_AHB3SMENR_QSPISMEN_POS 8U
#define STM32_RCC_AHB3SMENR_QSPISMEN_MSK \
	(0x1UL << STM32_RCC_AHB3SMENR_QSPISMEN_POS)
#define STM32_RCC_AHB3SMENR_QSPISMEN STM32_RCC_AHB3SMENR_QSPISMEN_MSK

/*************  BIT DEFINITION FOR STM32_RCC_APB1SMENR1 REGISTER  *************/
#define STM32_RCC_APB1SMENR1_TIM2SMEN_POS 0U
#define STM32_RCC_APB1SMENR1_TIM2SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_TIM2SMEN_POS)
#define STM32_RCC_APB1SMENR1_TIM2SMEN STM32_RCC_APB1SMENR1_TIM2SMEN_MSK
#define STM32_RCC_APB1SMENR1_TIM3SMEN_POS 1U
#define STM32_RCC_APB1SMENR1_TIM3SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_TIM3SMEN_POS)
#define STM32_RCC_APB1SMENR1_TIM3SMEN STM32_RCC_APB1SMENR1_TIM3SMEN_MSK
#define STM32_RCC_APB1SMENR1_TIM4SMEN_POS 2U
#define STM32_RCC_APB1SMENR1_TIM4SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_TIM4SMEN_POS)
#define STM32_RCC_APB1SMENR1_TIM4SMEN STM32_RCC_APB1SMENR1_TIM4SMEN_MSK
#define STM32_RCC_APB1SMENR1_TIM5SMEN_POS 3U
#define STM32_RCC_APB1SMENR1_TIM5SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_TIM5SMEN_POS)
#define STM32_RCC_APB1SMENR1_TIM5SMEN STM32_RCC_APB1SMENR1_TIM5SMEN_MSK
#define STM32_RCC_APB1SMENR1_TIM6SMEN_POS 4U
#define STM32_RCC_APB1SMENR1_TIM6SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_TIM6SMEN_POS)
#define STM32_RCC_APB1SMENR1_TIM6SMEN STM32_RCC_APB1SMENR1_TIM6SMEN_MSK
#define STM32_RCC_APB1SMENR1_TIM7SMEN_POS 5U
#define STM32_RCC_APB1SMENR1_TIM7SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_TIM7SMEN_POS)
#define STM32_RCC_APB1SMENR1_TIM7SMEN STM32_RCC_APB1SMENR1_TIM7SMEN_MSK
#define STM32_RCC_APB1SMENR1_RTCAPBSMEN_POS 10U
#define STM32_RCC_APB1SMENR1_RTCAPBSMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_RTCAPBSMEN_POS)
#define STM32_RCC_APB1SMENR1_RTCAPBSMEN STM32_RCC_APB1SMENR1_RTCAPBSMEN_MSK
#define STM32_RCC_APB1SMENR1_WWDGSMEN_POS 11U
#define STM32_RCC_APB1SMENR1_WWDGSMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_WWDGSMEN_POS)
#define STM32_RCC_APB1SMENR1_WWDGSMEN STM32_RCC_APB1SMENR1_WWDGSMEN_MSK
#define STM32_RCC_APB1SMENR1_SPI2SMEN_POS 14U
#define STM32_RCC_APB1SMENR1_SPI2SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_SPI2SMEN_POS)
#define STM32_RCC_APB1SMENR1_SPI2SMEN STM32_RCC_APB1SMENR1_SPI2SMEN_MSK
#define STM32_RCC_APB1SMENR1_SPI3SMEN_POS 15U
#define STM32_RCC_APB1SMENR1_SPI3SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_SPI3SMEN_POS)
#define STM32_RCC_APB1SMENR1_SPI3SMEN STM32_RCC_APB1SMENR1_SPI3SMEN_MSK
#define STM32_RCC_APB1SMENR1_USART2SMEN_POS 17U
#define STM32_RCC_APB1SMENR1_USART2SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_USART2SMEN_POS)
#define STM32_RCC_APB1SMENR1_USART2SMEN STM32_RCC_APB1SMENR1_USART2SMEN_MSK
#define STM32_RCC_APB1SMENR1_USART3SMEN_POS 18U
#define STM32_RCC_APB1SMENR1_USART3SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_USART3SMEN_POS)
#define STM32_RCC_APB1SMENR1_USART3SMEN STM32_RCC_APB1SMENR1_USART3SMEN_MSK
#define STM32_RCC_APB1SMENR1_USART4SMEN_POS 19U
#define STM32_RCC_APB1SMENR1_USART4SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_USART4SMEN_POS)
#define STM32_RCC_APB1SMENR1_USART4SMEN STM32_RCC_APB1SMENR1_USART4SMEN_MSK
#define STM32_RCC_APB1SMENR1_USART5SMEN_POS 20U
#define STM32_RCC_APB1SMENR1_USART5SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_USART5SMEN_POS)
#define STM32_RCC_APB1SMENR1_USART5SMEN STM32_RCC_APB1SMENR1_USART5SMEN_MSK
#define STM32_RCC_APB1SMENR1_I2C1SMEN_POS 21U
#define STM32_RCC_APB1SMENR1_I2C1SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_I2C1SMEN_POS)
#define STM32_RCC_APB1SMENR1_I2C1SMEN STM32_RCC_APB1SMENR1_I2C1SMEN_MSK
#define STM32_RCC_APB1SMENR1_I2C2SMEN_POS 22U
#define STM32_RCC_APB1SMENR1_I2C2SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_I2C2SMEN_POS)
#define STM32_RCC_APB1SMENR1_I2C2SMEN STM32_RCC_APB1SMENR1_I2C2SMEN_MSK
#define STM32_RCC_APB1SMENR1_I2C3SMEN_POS 23U
#define STM32_RCC_APB1SMENR1_I2C3SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_I2C3SMEN_POS)
#define STM32_RCC_APB1SMENR1_I2C3SMEN STM32_RCC_APB1SMENR1_I2C3SMEN_MSK
#define STM32_RCC_APB1SMENR1_CRSSMEN_POS 24U
#define STM32_RCC_APB1SMENR1_CRSSMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_CRSSMEN_POS)
#define STM32_RCC_APB1SMENR1_CRSSMEN STM32_RCC_APB1SMENR1_CRSSMEN_MSK
#define STM32_RCC_APB1SMENR1_PWRSMEN_POS 28U
#define STM32_RCC_APB1SMENR1_PWRSMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_PWRSMEN_POS)
#define STM32_RCC_APB1SMENR1_PWRSMEN STM32_RCC_APB1SMENR1_PWRSMEN_MSK
#define STM32_RCC_APB1SMENR1_DAC1SMEN_POS 29U
#define STM32_RCC_APB1SMENR1_DAC1SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_DAC1SMEN_POS)
#define STM32_RCC_APB1SMENR1_DAC1SMEN STM32_RCC_APB1SMENR1_DAC1SMEN_MSK
#define STM32_RCC_APB1SMENR1_OPAMPSMEN_POS 30U
#define STM32_RCC_APB1SMENR1_OPAMPSMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_OPAMPSMEN_POS)
#define STM32_RCC_APB1SMENR1_OPAMPSMEN STM32_RCC_APB1SMENR1_OPAMPSMEN_MSK
#define STM32_RCC_APB1SMENR1_LPTIM1SMEN_POS 31U
#define STM32_RCC_APB1SMENR1_LPTIM1SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR1_LPTIM1SMEN_POS)
#define STM32_RCC_APB1SMENR1_LPTIM1SMEN STM32_RCC_APB1SMENR1_LPTIM1SMEN_MSK

/*************  BIT DEFINITION FOR STM32_RCC_APB1SMENR2 REGISTER  *************/
#define STM32_RCC_APB1SMENR2_LPUART1SMEN_POS 0U
#define STM32_RCC_APB1SMENR2_LPUART1SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR2_LPUART1SMEN_POS)
#define STM32_RCC_APB1SMENR2_LPUART1SMEN STM32_RCC_APB1SMENR2_LPUART1SMEN_MSK
#define STM32_RCC_APB1SMENR2_I2C4SMEN_POS 1U
#define STM32_RCC_APB1SMENR2_I2C4SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR2_I2C4SMEN_POS)
#define STM32_RCC_APB1SMENR2_I2C4SMEN STM32_RCC_APB1SMENR2_I2C4SMEN_MSK
#define STM32_RCC_APB1SMENR2_LPTIM2SMEN_POS 5U
#define STM32_RCC_APB1SMENR2_LPTIM2SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR2_LPTIM2SMEN_POS)
#define STM32_RCC_APB1SMENR2_LPTIM2SMEN STM32_RCC_APB1SMENR2_LPTIM2SMEN_MSK
#define STM32_RCC_APB1SMENR2_LPTIM3SMEN_POS 6U
#define STM32_RCC_APB1SMENR2_LPTIM3SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR2_LPTIM3SMEN_POS)
#define STM32_RCC_APB1SMENR2_LPTIM3SMEN STM32_RCC_APB1SMENR2_LPTIM3SMEN_MSK
#define STM32_RCC_APB1SMENR2_FDCAN1SMEN_POS 9U
#define STM32_RCC_APB1SMENR2_FDCAN1SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR2_FDCAN1SMEN_POS)
#define STM32_RCC_APB1SMENR2_FDCAN1SMEN STM32_RCC_APB1SMENR2_FDCAN1SMEN_MSK
#define STM32_RCC_APB1SMENR2_USBFSSMEN_POS 21U
#define STM32_RCC_APB1SMENR2_USBFSSMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR2_USBFSSMEN_POS)
#define STM32_RCC_APB1SMENR2_USBFSSMEN STM32_RCC_APB1SMENR2_USBFSSMEN_MSK
#define STM32_RCC_APB1SMENR2_UCPD1SMEN_POS 23U
#define STM32_RCC_APB1SMENR2_UCPD1SMEN_MSK \
	(0x1UL << STM32_RCC_APB1SMENR2_UCPD1SMEN_POS)
#define STM32_RCC_APB1SMENR2_UCPD1SMEN STM32_RCC_APB1SMENR2_UCPD1SMEN_MSK

