FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
/************  BIT DEFINITION FOR STM32_RCC_APB2SMENR REGISTER  *************/
#define STM32_RCC_APB2SMENR_SYSCFGSMEN_POS 0U
#define STM32_RCC_APB2SMENR_SYSCFGSMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_SYSCFGSMEN_POS)
#define STM32_RCC_APB2SMENR_SYSCFGSMEN STM32_RCC_APB2SMENR_SYSCFGSMEN_MSK
#define STM32_RCC_APB2SMENR_TIM1SMEN_POS 11U
#define STM32_RCC_APB2SMENR_TIM1SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_TIM1SMEN_POS)
#define STM32_RCC_APB2SMENR_TIM1SMEN STM32_RCC_APB2SMENR_TIM1SMEN_MSK
#define STM32_RCC_APB2SMENR_SPI1SMEN_POS 12U
#define STM32_RCC_APB2SMENR_SPI1SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_SPI1SMEN_POS)
#define STM32_RCC_APB2SMENR_SPI1SMEN STM32_RCC_APB2SMENR_SPI1SMEN_MSK
#define STM32_RCC_APB2SMENR_TIM8SMEN_POS 13U
#define STM32_RCC_APB2SMENR_TIM8SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_TIM8SMEN_POS)
#define STM32_RCC_APB2SMENR_TIM8SMEN STM32_RCC_APB2SMENR_TIM8SMEN_MSK
#define STM32_RCC_APB2SMENR_USART1SMEN_POS 14U
#define STM32_RCC_APB2SMENR_USART1SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_USART1SMEN_POS)
#define STM32_RCC_APB2SMENR_USART1SMEN STM32_RCC_APB2SMENR_USART1SMEN_MSK
#define STM32_RCC_APB2SMENR_TIM15SMEN_POS 16U
#define STM32_RCC_APB2SMENR_TIM15SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_TIM15SMEN_POS)
#define STM32_RCC_APB2SMENR_TIM15SMEN STM32_RCC_APB2SMENR_TIM15SMEN_MSK
#define STM32_RCC_APB2SMENR_TIM16SMEN_POS 17U
#define STM32_RCC_APB2SMENR_TIM16SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_TIM16SMEN_POS)
#define STM32_RCC_APB2SMENR_TIM16SMEN STM32_RCC_APB2SMENR_TIM16SMEN_MSK
#define STM32_RCC_APB2SMENR_TIM17SMEN_POS 18U
#define STM32_RCC_APB2SMENR_TIM17SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_TIM17SMEN_POS)
#define STM32_RCC_APB2SMENR_TIM17SMEN STM32_RCC_APB2SMENR_TIM17SMEN_MSK
#define STM32_RCC_APB2SMENR_SAI1SMEN_POS 21U
#define STM32_RCC_APB2SMENR_SAI1SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_SAI1SMEN_POS)
#define STM32_RCC_APB2SMENR_SAI1SMEN STM32_RCC_APB2SMENR_SAI1SMEN_MSK
#define STM32_RCC_APB2SMENR_SAI2SMEN_POS 22U
#define STM32_RCC_APB2SMENR_SAI2SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_SAI2SMEN_POS)
#define STM32_RCC_APB2SMENR_SAI2SMEN STM32_RCC_APB2SMENR_SAI2SMEN_MSK
#define STM32_RCC_APB2SMENR_DFSDM1SMEN_POS 24U
#define STM32_RCC_APB2SMENR_DFSDM1SMEN_MSK \
	(0x1UL << STM32_RCC_APB2SMENR_DFSDM1SMEN_POS)
#define STM32_RCC_APB2SMENR_DFSDM1SMEN STM32_RCC_APB2SMENR_DFSDM1SMEN_MSK

/*************  BIT DEFINITION FOR STM32_RCC_CCIPR1 REGISTER  *****************/
#define STM32_RCC_CCIPR1_USART1SEL_POS 0U
#define STM32_RCC_CCIPR1_USART1SEL_MSK (0x3UL << STM32_RCC_CCIPR_USART1SEL_POS)
#define STM32_RCC_CCIPR1_USART1SEL STM32_RCC_CCIPR_USART1SEL_MSK
#define STM32_RCC_CCIPR1_USART1SEL_0 (0x1UL << STM32_RCC_CCIPR_USART1SEL_POS)
#define STM32_RCC_CCIPR1_USART1SEL_1 (0x2UL << STM32_RCC_CCIPR_USART1SEL_POS)

#define STM32_RCC_CCIPR1_USART2SEL_POS 2U
#define STM32_RCC_CCIPR1_USART2SEL_MSK (0x3UL << STM32_RCC_CCIPR_USART2SEL_POS)
#define STM32_RCC_CCIPR1_USART2SEL STM32_RCC_CCIPR_USART2SEL_MSK
#define STM32_RCC_CCIPR1_USART2SEL_0 (0x1UL << STM32_RCC_CCIPR_USART2SEL_POS)
#define STM32_RCC_CCIPR1_USART2SEL_1 (0x2UL << STM32_RCC_CCIPR_USART2SEL_POS)

#define STM32_RCC_CCIPR1_USART3SEL_POS 4U
#define STM32_RCC_CCIPR1_USART3SEL_MSK (0x3UL << STM32_RCC_CCIPR_USART3SEL_POS)
#define STM32_RCC_CCIPR1_USART3SEL STM32_RCC_CCIPR_USART3SEL_MSK
#define STM32_RCC_CCIPR1_USART3SEL_0 (0x1UL << STM32_RCC_CCIPR_USART3SEL_POS)
#define STM32_RCC_CCIPR1_USART3SEL_1 (0x2UL << STM32_RCC_CCIPR_USART3SEL_POS)

#define STM32_RCC_CCIPR1_USART4SEL_POS 6U
#define STM32_RCC_CCIPR1_USART4SEL_MSK (0x3UL << STM32_RCC_CCIPR_USART4SEL_POS)
#define STM32_RCC_CCIPR1_USART4SEL STM32_RCC_CCIPR_USART4SEL_MSK
#define STM32_RCC_CCIPR1_USART4SEL_0 (0x1UL << STM32_RCC_CCIPR_USART4SEL_POS)
#define STM32_RCC_CCIPR1_USART4SEL_1 (0x2UL << STM32_RCC_CCIPR_USART4SEL_POS)

#define STM32_RCC_CCIPR1_USART5SEL_POS 8U
#define STM32_RCC_CCIPR1_USART5SEL_MSK (0x3UL << STM32_RCC_CCIPR_USART5SEL_POS)
#define STM32_RCC_CCIPR1_USART5SEL STM32_RCC_CCIPR_USART5SEL_MSK
#define STM32_RCC_CCIPR1_USART5SEL_0 (0x1UL << STM32_RCC_CCIPR_USART5SEL_POS)
#define STM32_RCC_CCIPR1_USART5SEL_1 (0x2UL << STM32_RCC_CCIPR_USART5SEL_POS)

#define STM32_RCC_CCIPR1_LPUART1SEL_POS 10U
#define STM32_RCC_CCIPR1_LPUART1SEL_MSK \
	(0x3UL << STM32_RCC_CCIPR_LPUART1SEL_POS)
#define STM32_RCC_CCIPR1_LPUART1SEL STM32_RCC_CCIPR_LPUART1SEL_MSK
#define STM32_RCC_CCIPR1_LPUART1SEL_0 (0x1UL << STM32_RCC_CCIPR_LPUART1SEL_POS)
#define STM32_RCC_CCIPR1_LPUART1SEL_1 (0x2UL << STM32_RCC_CCIPR_LPUART1SEL_POS)

#define STM32_RCC_CCIPR1_I2C1SEL_POS 12U
#define STM32_RCC_CCIPR1_I2C1SEL_MSK (0x3UL << STM32_RCC_CCIPR_I2C1SEL_POS)
#define STM32_RCC_CCIPR1_I2C1SEL STM32_RCC_CCIPR_I2C1SEL_MSK
#define STM32_RCC_CCIPR1_I2C1SEL_0 (0x1UL << STM32_RCC_CCIPR_I2C1SEL_POS)
#define STM32_RCC_CCIPR1_I2C1SEL_1 (0x2UL << STM32_RCC_CCIPR_I2C1SEL_POS)

#define STM32_RCC_CCIPR1_I2C2SEL_POS 14U
#define STM32_RCC_CCIPR1_I2C2SEL_MSK (0x3UL << STM32_RCC_CCIPR_I2C2SEL_POS)
#define STM32_RCC_CCIPR1_I2C2SEL STM32_RCC_CCIPR_I2C2SEL_MSK
#define STM32_RCC_CCIPR1_I2C2SEL_0 (0x1UL << STM32_RCC_CCIPR_I2C2SEL_POS)
#define STM32_RCC_CCIPR1_I2C2SEL_1 (0x2UL << STM32_RCC_CCIPR_I2C2SEL_POS)

#define STM32_RCC_CCIPR1_I2C3SEL_POS 16U
#define STM32_RCC_CCIPR1_I2C3SEL_MSK (0x3UL << STM32_RCC_CCIPR_I2C3SEL_POS)
#define STM32_RCC_CCIPR1_I2C3SEL STM32_RCC_CCIPR_I2C3SEL_MSK
#define STM32_RCC_CCIPR1_I2C3SEL_0 (0x1UL << STM32_RCC_CCIPR_I2C3SEL_POS)
#define STM32_RCC_CCIPR1_I2C3SEL_1 (0x2UL << STM32_RCC_CCIPR_I2C3SEL_POS)

#define STM32_RCC_CCIPR1_LPTIM1SEL_POS 18U
#define STM32_RCC_CCIPR1_LPTIM1SEL_MSK (0x3UL << STM32_RCC_CCIPR_LPTIM1SEL_POS)
#define STM32_RCC_CCIPR1_LPTIM1SEL STM32_RCC_CCIPR_LPTIM1SEL_MSK
#define STM32_RCC_CCIPR1_LPTIM1SEL_0 (0x1UL << STM32_RCC_CCIPR_LPTIM1SEL_POS)
#define STM32_RCC_CCIPR1_LPTIM1SEL_1 (0x2UL << STM32_RCC_CCIPR_LPTIM1SEL_POS)

#define STM32_RCC_CCIPR1_LPTIM2SEL_POS 20U
#define STM32_RCC_CCIPR1_LPTIM2SEL_MSK (0x3UL << STM32_RCC_CCIPR_LPTIM2SEL_POS)
#define STM32_RCC_CCIPR1_LPTIM2SEL STM32_RCC_CCIPR_LPTIM2SEL_MSK
#define STM32_RCC_CCIPR1_LPTIM2SEL_0 (0x1UL << STM32_RCC_CCIPR_LPTIM2SEL_POS)
#define STM32_RCC_CCIPR1_LPTIM2SEL_1 (0x2UL << STM32_RCC_CCIPR_LPTIM2SEL_POS)

#define STM32_RCC_CCIPR1_LPTIM3SEL_POS 22U
#define STM32_RCC_CCIPR1_LPTIM3SEL_MSK (0x3UL << STM32_RCC_CCIPR_LPTIM3SEL_POS)
#define STM32_RCC_CCIPR1_LPTIM3SEL STM32_RCC_CCIPR_LPTIM3SEL_MSK
#define STM32_RCC_CCIPR1_LPTIM3SEL_0 (0x1UL << STM32_RCC_CCIPR_LPTIM3SEL_POS)
#define STM32_RCC_CCIPR1_LPTIM3SEL_1 (0x2UL << STM32_RCC_CCIPR_LPTIM3SEL_POS)

#define STM32_RCC_CCIPR1_FDCANSEL_POS 24U
#define STM32_RCC_CCIPR1_FDCANSEL_MSK (0x3UL << STM32_RCC_CCIPR_FDCANSEL_POS)
#define STM32_RCC_CCIPR1_FDCANSEL STM32_RCC_CCIPR_FDCANSEL_MSK
#define STM32_RCC_CCIPR1_FDCANSEL_0 (0x1UL << STM32_RCC_CCIPR_FDCANSEL_POS)
#define STM32_RCC_CCIPR1_FDCANSEL_1 (0x2UL << STM32_RCC_CCIPR_FDCANSEL_POS)

#define STM32_RCC_CCIPR1_CLK48SEL_POS 26U
#define STM32_RCC_CCIPR1_CLK48SEL_MSK (0x3UL << STM32_RCC_CCIPR_CLK48SEL_POS)
#define STM32_RCC_CCIPR1_CLK48SEL STM32_RCC_CCIPR_CLK48SEL_MSK
#define STM32_RCC_CCIPR1_CLK48SEL_0 (0x1UL << STM32_RCC_CCIPR_CLK48SEL_POS)
#define STM32_RCC_CCIPR1_CLK48SEL_1 (0x2UL << STM32_RCC_CCIPR_CLK48SEL_POS)

#define STM32_RCC_CCIPR_ADCSEL_POS 28U
#define STM32_RCC_CCIPR_ADCSEL_MSK (0x3UL << STM32_RCC_CCIPR_ADCSEL_POS)
#define STM32_RCC_CCIPR_ADCSEL STM32_RCC_CCIPR_ADCSEL_MSK
#define STM32_RCC_CCIPR_ADCSEL_0 (0x1UL << STM32_RCC_CCIPR_ADCSEL_POS)
#define STM32_RCC_CCIPR_ADCSEL_1 (0x2UL << STM32_RCC_CCIPR_ADCSEL_POS)

/**************  BIT DEFINITION FOR STM32_RCC_BDCR REGISTER  ******************/
#define STM32_RCC_BDCR_LSEBYP_POS 2U
#define STM32_RCC_BDCR_LSEBYP_MSK (0x1UL << STM32_RCC_BDCR_LSEBYP_POS)
#define STM32_RCC_BDCR_LSEBYP STM32_RCC_BDCR_LSEBYP_MSK

