FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
#define STM32_RCC_BDCR_LSEDRV_POS 3U
#define STM32_RCC_BDCR_LSEDRV_MSK (0x3UL << STM32_RCC_BDCR_LSEDRV_POS)
#define STM32_RCC_BDCR_LSEDRV STM32_RCC_BDCR_LSEDRV_MSK
#define STM32_RCC_BDCR_LSEDRV_0 (0x1UL << STM32_RCC_BDCR_LSEDRV_POS)
#define STM32_RCC_BDCR_LSEDRV_1 (0x2UL << STM32_RCC_BDCR_LSEDRV_POS)

#define STM32_RCC_BDCR_LSECSSON_POS 5U
#define STM32_RCC_BDCR_LSECSSON_MSK (0x1UL << STM32_RCC_BDCR_LSECSSON_POS)
#define STM32_RCC_BDCR_LSECSSON STM32_RCC_BDCR_LSECSSON_MSK
#define STM32_RCC_BDCR_LSECSSD_POS 6U
#define STM32_RCC_BDCR_LSECSSD_MSK (0x1UL << STM32_RCC_BDCR_LSECSSD_POS)
#define STM32_RCC_BDCR_LSECSSD STM32_RCC_BDCR_LSECSSD_MSK
#define STM32_RCC_BDCR_LSESYSEN_POS 7U
#define STM32_RCC_BDCR_LSESYSEN_MSK (0x1UL << STM32_RCC_BDCR_LSESYSEN_POS)
#define STM32_RCC_BDCR_LSESYSEN STM32_RCC_BDCR_LSESYSEN_MSK

#define STM32_RCC_BDCR_RTCSEL_POS 8U
#define STM32_RCC_BDCR_RTCSEL_MSK (0x3UL << STM32_RCC_BDCR_RTCSEL_POS)
#define STM32_RCC_BDCR_RTCSEL STM32_RCC_BDCR_RTCSEL_MSK
#define STM32_RCC_BDCR_RTCSEL_0 (0x1UL << STM32_RCC_BDCR_RTCSEL_POS)
#define STM32_RCC_BDCR_RTCSEL_1 (0x2UL << STM32_RCC_BDCR_RTCSEL_POS)

#define STM32_RCC_BDCR_LSESYSRDY_POS 11U
#define STM32_RCC_BDCR_LSESYSRDY_MSK (0x1UL << STM32_RCC_BDCR_LSESYSRDY_POS)
#define STM32_RCC_BDCR_LSESYSRDY STM32_RCC_BDCR_LSESYSRDY_MSK
#define STM32_RCC_BDCR_LSCOEN_POS 24U
#define STM32_RCC_BDCR_LSCOEN_MSK (0x1UL << STM32_RCC_BDCR_LSCOEN_POS)
#define STM32_RCC_BDCR_LSCOEN STM32_RCC_BDCR_LSCOEN_MSK
#define STM32_RCC_BDCR_LSCOSEL_POS 25U
#define STM32_RCC_BDCR_LSCOSEL_MSK (0x1UL << STM32_RCC_BDCR_LSCOSEL_POS)
#define STM32_RCC_BDCR_LSCOSEL STM32_RCC_BDCR_LSCOSEL_MSK

/**************  BIT DEFINITION FOR STM32_RCC_CSR REGISTER  *******************/
#define STM32_RCC_CSR_LSION_POS 0U
#define STM32_RCC_CSR_LSION_MSK (0x1UL << STM32_RCC_CSR_LSION_POS)
#define STM32_RCC_CSR_LSION STM32_RCC_CSR_LSION_MSK
#define STM32_RCC_CSR_LSIRDY_POS 1U
#define STM32_RCC_CSR_LSIRDY_MSK (0x1UL << STM32_RCC_CSR_LSIRDY_POS)
#define STM32_RCC_CSR_LSIRDY STM32_RCC_CSR_LSIRDY_MSK
#define STM32_RCC_CSR_LSIPRE_POS 4U
#define STM32_RCC_CSR_LSIPRE_MSK (0x1UL << STM32_RCC_CSR_LSIPRE_POS)
#define STM32_RCC_CSR_LSIPRE STM32_RCC_CSR_LSIPRE_MSK

#define STM32_RCC_CSR_MSISRANGE_POS 8U
#define STM32_RCC_CSR_MSISRANGE_MSK (0xFUL << STM32_RCC_CSR_MSISRANGE_POS)
#define STM32_RCC_CSR_MSISRANGE STM32_RCC_CSR_MSISRANGE_MSK
#define STM32_RCC_CSR_MSISRANGE_1 (0x4UL << STM32_RCC_CSR_MSISRANGE_POS)
#define STM32_RCC_CSR_MSISRANGE_2 (0x5UL << STM32_RCC_CSR_MSISRANGE_POS)
#define STM32_RCC_CSR_MSISRANGE_4 (0x6UL << STM32_RCC_CSR_MSISRANGE_POS)
#define STM32_RCC_CSR_MSISRANGE_8 (0x7UL << STM32_RCC_CSR_MSISRANGE_POS)

#define STM32_RCC_CSR_RMVF_POS 23U
#define STM32_RCC_CSR_RMVF_MSK (0x1UL << STM32_RCC_CSR_RMVF_POS)
#define STM32_RCC_CSR_RMVF STM32_RCC_CSR_RMVF_MSK
#define STM32_RCC_CSR_OBLRSTF_POS 25U
#define STM32_RCC_CSR_OBLRSTF_MSK (0x1UL << STM32_RCC_CSR_OBLRSTF_POS)
#define STM32_RCC_CSR_OBLRSTF STM32_RCC_CSR_OBLRSTF_MSK
#define STM32_RCC_CSR_PINRSTF_POS 26U
#define STM32_RCC_CSR_PINRSTF_MSK (0x1UL << STM32_RCC_CSR_PINRSTF_POS)
#define STM32_RCC_CSR_PINRSTF STM32_RCC_CSR_PINRSTF_MSK
#define STM32_RCC_CSR_BORRSTF_POS 27U
#define STM32_RCC_CSR_BORRSTF_MSK (0x1UL << STM32_RCC_CSR_BORRSTF_POS)
#define STM32_RCC_CSR_BORRSTF STM32_RCC_CSR_BORRSTF_MSK
#define STM32_RCC_CSR_SFTRSTF_POS 28U
#define STM32_RCC_CSR_SFTRSTF_MSK (0x1UL << STM32_RCC_CSR_SFTRSTF_POS)
#define STM32_RCC_CSR_SFTRSTF STM32_RCC_CSR_SFTRSTF_MSK
#define STM32_RCC_CSR_IWDGRSTF_POS 29U
#define STM32_RCC_CSR_IWDGRSTF_MSK (0x1UL << STM32_RCC_CSR_IWDGRSTF_POS)
#define STM32_RCC_CSR_IWDGRSTF STM32_RCC_CSR_IWDGRSTF_MSK
#define STM32_RCC_CSR_WWDGRSTF_POS 30U
#define STM32_RCC_CSR_WWDGRSTF_MSK (0x1UL << STM32_RCC_CSR_WWDGRSTF_POS)
#define STM32_RCC_CSR_WWDGRSTF STM32_RCC_CSR_WWDGRSTF_MSK
#define STM32_RCC_CSR_LPWRRSTF_POS 31U
#define STM32_RCC_CSR_LPWRRSTF_MSK (0x1UL << STM32_RCC_CSR_LPWRRSTF_POS)
#define STM32_RCC_CSR_LPWRRSTF STM32_RCC_CSR_LPWRRSTF_MSK

/**************  Bit definition for STM32_RCC_CRRCR register  *****************/
#define STM32_RCC_CRRCR_HSI48ON_POS 0U
#define STM32_RCC_CRRCR_HSI48ON_MSK (0x1UL << STM32_RCC_CRRCR_HSI48ON_POS)
#define STM32_RCC_CRRCR_HSI48ON STM32_RCC_CRRCR_HSI48ON_MSK
#define STM32_RCC_CRRCR_HSI48RDY_POS 1U
#define STM32_RCC_CRRCR_HSI48RDY_MSK (0x1UL << STM32_RCC_CRRCR_HSI48RDY_POS)
#define STM32_RCC_CRRCR_HSI48RDY STM32_RCC_CRRCR_HSI48RDY_MSK

/**************  Bit definition for STM32_RCC_CRRCR2 register  ****************/
/* TODO */

/**************  Bit definition for STM32_RCC_DLYCFGR register  ***************/
/* TODO */

/**************  Bit definition for STM32_RCC_CCIPR2 register  ****************/
/* TODO */

/**************  Bit definition for STM32_CRS_CR register  ********************/
#define STM32_CRS_CR_SYNCOKIE_POS 0U
#define STM32_CRS_CR_SYNCOKIE_MSK (0x1UL << STM32_CRS_CR_SYNCOKIE_POS)
#define STM32_CRS_CR_SYNCOKIE STM32_CRS_CR_SYNCOKIE_MSK
#define STM32_CRS_CR_SYNCWARNIE_POS 1U
#define STM32_CRS_CR_SYNCWARNIE_MSK (0x1UL << STM32_CRS_CR_SYNCWARNIE_POS)
#define STM32_CRS_CR_SYNCWARNIE STM32_CRS_CR_SYNCWARNIE_MSK
#define STM32_CRS_CR_SYNCERRIE_POS 2U
#define STM32_CRS_CR_SYNCERRIE_MSK (0x1UL << STM32_CRS_CR_SYNCERRIE_POS)
#define STM32_CRS_CR_SYNCERRIE STM32_CRS_CR_SYNCERRIE_MSK
#define STM32_CRS_CR_SYNCIE_POS 3U
#define STM32_CRS_CR_SYNCIE_MSK (0x1UL << STM32_CRS_CR_SYNCIE_POS)
#define STM32_CRS_CR_SYNCIE STM32_CRS_CR_SYNCIE_MSK
#define STM32_CRS_CR_CEN_POS 5U
#define STM32_CRS_CR_CEN_MSK (0x1UL << STM32_CRS_CR_CEN_POS)
#define STM32_CRS_CR_CEN STM32_CRS_CR_CEN_MSK
#define STM32_CRS_CR_AUTOTRIMEN_POS 6U
#define STM32_CRS_CR_AUTOTRIMEN_MSK (0x1UL << STM32_CRS_CR_AUTOTRIMEN_POS)
#define STM32_CRS_CR_AUTOTRIMEN STM32_CRS_CR_AUTOTRIMEN_MSK
#define STM32_CRS_CR_SWSYNC_POS 7U
#define STM32_CRS_CR_SWSYNC_MSK (0x1UL << STM32_CRS_CR_SWSYNC_POS)
#define STM32_CRS_CR_SWSYNC STM32_CRS_CR_SWSYNC_MSK

/*!< HSI48CAL configuration */
#define STM32_RCC_CRRCR_HSI48CAL_POS 7U
#define STM32_RCC_CRRCR_HSI48CAL_MSK (0x1FFUL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL STM32_RCC_CRRCR_HSI48CAL_MSK
#define STM32_RCC_CRRCR_HSI48CAL_0 (0x001UL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL_1 (0x002UL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL_2 (0x004UL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL_3 (0x008UL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL_4 (0x010UL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL_5 (0x020UL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL_6 (0x040UL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL_7 (0x080UL << STM32_RCC_CRRCR_HSI48CAL_POS)
#define STM32_RCC_CRRCR_HSI48CAL_8 (0x100UL << STM32_RCC_CRRCR_HSI48CAL_POS)

#define STM32_SYSCFG_CFGR1 REG32(STM32_SYSCFG_BASE + 0x04)
#define STM32_SYSCFG_I2CFMP(n) BIT(n + 21)

/* Peripheral bits for STM32_RCC_APB/AHB and DBGMCU regs */
#define STM32_RCC_PB1_PWREN BIT(28)

#define STM32_RCC_PB2_SYSCFGEN BIT(0)
#define STM32_RCC_PB2_USART1 BIT(14)

#define STM32_RCC_HB1_DMA1 BIT(0)
#define STM32_RCC_HB1_DMA2 BIT(1)

#define STM32_RCC_HB2_GPIOA BIT(0)
#define STM32_RCC_HB2_GPIOB BIT(1)
#define STM32_RCC_HB2_GPIOC BIT(2)
#define STM32_RCC_HB2_GPIOD BIT(3)
#define STM32_RCC_HB2_GPIOE BIT(4)
#define STM32_RCC_HB2_GPIOH BIT(7)
#define STM32_RCC_HB2_ADC1 BIT(13)

/* Reset causes definitions */
/* Reset causes in RCC CSR register */
#define STM32_RCC_RESET_CAUSE STM32_RCC_CSR
#define RESET_CAUSE_WDG 0x60000000
#define RESET_CAUSE_SFT 0x10000000
#define RESET_CAUSE_POR 0x08000000
#define RESET_CAUSE_PIN 0x04000000
#define RESET_CAUSE_OTHER 0xff000000
#define RESET_CAUSE_RMVF BIT(23)
/* Power cause in PWR CSR register */
#define STM32_PWR_RESET_CAUSE STM32_PWR_CSR
#define STM32_PWR_RESET_CAUSE_CLR STM32_PWR_SCR
#define RESET_CAUSE_SBF BIT(8)
#define RESET_CAUSE_SBF_CLR BIT(8)

/* --- Watchdogs --- */

/* --- Real-Time Clock --- */
#define STM32_RTC_TR REG32(STM32_RTC_BASE + 0x00)
#define STM32_RTC_DR REG32(STM32_RTC_BASE + 0x04)
#define STM32_RTC_CR REG32(STM32_RTC_BASE + 0x08)
#define STM32_RTC_CR_BYPSHAD BIT(5)
#define STM32_RTC_CR_ALRAE BIT(8)
#define STM32_RTC_CR_WUTE BIT(10)
#define STM32_RTC_CR_ALRAIE BIT(12)
#define STM32_RTC_CR_WUTIE BIT(14)
#define STM32_RTC_ISR REG32(STM32_RTC_BASE + 0x0C)
#define STM32_RTC_ISR_ALRAWF BIT(0)
#define STM32_RTC_ISR_WUTWF BIT(2)
#define STM32_RTC_ISR_INITS BIT(4)
#define STM32_RTC_ISR_RSF BIT(5)
#define STM32_RTC_ISR_INITF BIT(6)
#define STM32_RTC_ISR_INIT BIT(7)
#define STM32_RTC_ISR_ALRAF BIT(8)
#define STM32_RTC_ISR_WUTF BIT(9)
#define STM32_RTC_PRER REG32(STM32_RTC_BASE + 0x10)
#define STM32_RTC_PRER_A_MASK (0x7f << 16)
#define STM32_RTC_PRER_S_MASK (0x7fff << 0)
#define STM32_RTC_WUTR REG32(STM32_RTC_BASE + 0x14)
#define STM32_RTC_CALIBR REG32(STM32_RTC_BASE + 0x18)
#define STM32_RTC_ALRMAR REG32(STM32_RTC_BASE + 0x1C)
#define STM32_RTC_ALRMBR REG32(STM32_RTC_BASE + 0x20)
#define STM32_RTC_WPR REG32(STM32_RTC_BASE + 0x24)
#define STM32_RTC_SSR REG32(STM32_RTC_BASE + 0x28)
#define STM32_RTC_TSTR REG32(STM32_RTC_BASE + 0x30)
#define STM32_RTC_TSDR REG32(STM32_RTC_BASE + 0x34)
#define STM32_RTC_TAFCR REG32(STM32_RTC_BASE + 0x40)
#define STM32_RTC_ALRMASSR REG32(STM32_RTC_BASE + 0x44)

#define STM32_RTC_CLEAR_FLAG(x)                         \
	(STM32_RTC_ISR = (~((x) | STM32_RTC_ISR_INIT) | \
			  (STM32_RTC_ISR & STM32_RTC_ISR_INIT)))

