FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
/* --- Tamper and backup registers --- */
#define STM32_TAMP_CR1 REG32(STM32_TAMP_BASE)
#define STM32_TAMP_CR2 REG32(STM32_TAMP_BASE + 0x04)
#define STM32_TAMP_CR3 REG32(STM32_TAMP_BASE + 0x08)
#define STM32_TAMP_FLTCR REG32(STM32_TAMP_BASE + 0x0C)
#define STM32_TAMP_ATCR1 REG32(STM32_TAMP_BASE + 0x10)
#define STM32_TAMP_ATSEEDR REG32(STM32_TAMP_BASE + 0x14)
#define STM32_TAMP_ATOR REG32(STM32_TAMP_BASE + 0x18)
#define STM32_TAMP_ATOCR2 REG32(STM32_TAMP_BASE + 0x1C)
#define STM32_TAMP_ATSMCR REG32(STM32_TAMP_BASE + 0x20)
#define STM32_TAMP_PRIVCR REG32(STM32_TAMP_BASE + 0x24)
#define STM32_TAMP_IER REG32(STM32_TAMP_BASE + 0x2C)
#define STM32_TAMP_SR REG32(STM32_TAMP_BASE + 0x30)
#define STM32_TAMP_MISR REG32(STM32_TAMP_BASE + 0x34)
#define STM32_TAMP_SMISR REG32(STM32_TAMP_BASE + 0x38)
#define STM32_TAMP_SCR REG32(STM32_TAMP_BASE + 0x3C)
#define STM32_TAMP_COUNTR REG32(STM32_TAMP_BASE + 0x40)
#define STM32_TAMP_CFGR REG32(STM32_TAMP_BASE + 0x50)
#define STM32_TAMP_BACKUP(n) REG32(STM32_TAMP_BASE + 0x100 + 4 * (n))

#define STM32_BKP_DATA(n) STM32_TAMP_BACKUP(n)
#define STM32_BKP_BYTES 128

#define RTC_TR_PM_POS 22U
#define RTC_TR_PM_MSK (0x1UL << RTC_TR_PM_POS)
#define RTC_TR_PM RTC_TR_PM_MSK
#define RTC_TR_HT_POS 20U
#define RTC_TR_HT_MSK (0x3UL << RTC_TR_HT_POS)
#define RTC_TR_HT RTC_TR_HT_MSK
#define RTC_TR_HU_POS 16U
#define RTC_TR_HU_MSK (0xFUL << RTC_TR_HU_POS)
#define RTC_TR_HU RTC_TR_HU_MSK
#define RTC_TR_MNT_POS 12U
#define RTC_TR_MNT_MSK (0x7UL << RTC_TR_MNT_POS)
#define RTC_TR_MNT RTC_TR_MNT_MSK
#define RTC_TR_MNU_POS 8U
#define RTC_TR_MNU_MSK (0xFUL << RTC_TR_MNU_POS)
#define RTC_TR_MNU RTC_TR_MNU_MSK
#define RTC_TR_ST_POS 4U
#define RTC_TR_ST_MSK (0x7UL << RTC_TR_ST_POS)
#define RTC_TR_ST RTC_TR_ST_MSK
#define RTC_TR_SU_POS 0U
#define RTC_TR_SU_MSK (0xFUL << RTC_TR_SU_POS)
#define RTC_TR_SU RTC_TR_SU_MSK

/* --- SPI --- */

/* The SPI controller registers */
struct stm32_spi_regs {
	uint16_t cr1;
	uint16_t _pad0;
	uint16_t cr2;
	uint16_t _pad1;
	unsigned int sr;
	uint8_t dr;
	uint8_t _pad2;
	uint16_t _pad3;
	unsigned int crcpr;
	unsigned int rxcrcr;
	unsigned int txcrcr;
	unsigned int i2scfgr; /* STM32L only */
	unsigned int i2spr; /* STM32L only */
};
/* Must be volatile, or compiler optimizes out repeated accesses */
typedef volatile struct stm32_spi_regs stm32_spi_regs_t;

#define STM32_SPI1_REGS ((stm32_spi_regs_t *)STM32_SPI1_BASE)
#define STM32_SPI2_REGS ((stm32_spi_regs_t *)STM32_SPI2_BASE)
#define STM32_SPI3_REGS ((stm32_spi_regs_t *)STM32_SPI3_BASE)
#define STM32_SPI4_REGS ((stm32_spi_regs_t *)STM32_SPI4_BASE)

#define STM32_SPI_CR1_BIDIMODE BIT(15)
#define STM32_SPI_CR1_BIDIOE BIT(14)
#define STM32_SPI_CR1_CRCEN BIT(13)
#define STM32_SPI_CR1_SSM BIT(9)
#define STM32_SPI_CR1_SSI BIT(8)
#define STM32_SPI_CR1_LSBFIRST BIT(7)
#define STM32_SPI_CR1_SPE BIT(6)
#define STM32_SPI_CR1_BR_DIV64R (5 << 3)
#define STM32_SPI_CR1_BR_DIV4R BIT(3)
#define STM32_SPI_CR1_MSTR BIT(2)
#define STM32_SPI_CR1_CPOL BIT(1)
#define STM32_SPI_CR1_CPHA BIT(0)
#define STM32_SPI_CR2_FRXTH BIT(12)
#define STM32_SPI_CR2_DATASIZE(n) (((n)-1) << 8)
#define STM32_SPI_CR2_TXEIE BIT(7)
#define STM32_SPI_CR2_RXNEIE BIT(6)
#define STM32_SPI_CR2_NSSP BIT(3)
#define STM32_SPI_CR2_SSOE BIT(2)
#define STM32_SPI_CR2_TXDMAEN BIT(1)
#define STM32_SPI_CR2_RXDMAEN BIT(0)

#define STM32_SPI_SR_RXNE BIT(0)
#define STM32_SPI_SR_TXE BIT(1)
#define STM32_SPI_SR_CRCERR BIT(4)
#define STM32_SPI_SR_BSY BIT(7)
#define STM32_SPI_SR_FRLVL (3 << 9)
#define STM32_SPI_SR_FTLVL (3 << 11)
/* --- Debug --- */
#define STM32_DBGMCU_APB1FZ REG32(STM32_DBGMCU_BASE + 0x08)
#define STM32_DBGMCU_APB2FZ REG32(STM32_DBGMCU_BASE + 0x0C)

/* --- Flash --- */
#define STM32_FLASH_ACR REG32(STM32_FLASH_REGS_BASE + 0x00)
#define STM32_FLASH_ACR_LATENCY_SHIFT (0)
#define STM32_FLASH_ACR_LATENCY_MASK (7 << STM32_FLASH_ACR_LATENCY_SHIFT)
#define STM32_FLASH_ACR_PRFTEN BIT(8)
#define STM32_FLASH_ACR_ICEN BIT(9)
#define STM32_FLASH_ACR_DCEN BIT(10)
#define STM32_FLASH_ACR_ICRST BIT(11)
#define STM32_FLASH_ACR_DCRST BIT(12)
#define STM32_FLASH_PDKEYR REG32(STM32_FLASH_REGS_BASE + 0x04)
#define STM32_FLASH_KEYR REG32(STM32_FLASH_REGS_BASE + 0x08)
#define FLASH_KEYR_KEY1 0x45670123
#define FLASH_KEYR_KEY2 0xCDEF89AB
#define STM32_FLASH_OPTKEYR REG32(STM32_FLASH_REGS_BASE + 0x10)
#define FLASH_OPTKEYR_KEY1 0x08192A3B
#define FLASH_OPTKEYR_KEY2 0x4C5D6E7F
#define STM32_FLASH_SR REG32(STM32_FLASH_REGS_BASE + 0x20)
#define FLASH_SR_BUSY BIT(16)
#define FLASH_SR_ERR_MASK (0xc3fa)
#define STM32_FLASH_CR REG32(STM32_FLASH_REGS_BASE + 0x28)
#define FLASH_CR_PG BIT(0)
#define FLASH_CR_PER BIT(1)
#define FLASH_CR_STRT BIT(16)
#define FLASH_CR_OPTSTRT BIT(17)
#define FLASH_CR_OBL_LAUNCH BIT(27)
#define FLASH_CR_OPTLOCK BIT(30)
#define FLASH_CR_LOCK BIT(31)
#define FLASH_CR_PNB(sec) (((sec)&0xff) << 3)
#define FLASH_CR_PNB_MASK FLASH_CR_PNB(0xff)
#define STM32_FLASH_ECCR REG32(STM32_FLASH_REGS_BASE + 0x30)
#define STM32_FLASH_OPTR REG32(STM32_FLASH_REGS_BASE + 0x40)
#define STM32_FLASH_WRP1AR REG32(STM32_FLASH_REGS_BASE + 0x58)
#define STM32_FLASH_WRP1BR REG32(STM32_FLASH_REGS_BASE + 0x5C)
/* Minimum number of bytes that can be written to flash */
#define STM32_FLASH_MIN_WRITE_SIZE CONFIG_FLASH_WRITE_SIZE

#define STM32_OPTB_WRP1AR STM32_FLASH_WRP1AR
#define STM32_OPTB_WRP1BR STM32_FLASH_WRP1BR

/* --- External Interrupts --- */
#define STM32_EXTI_RTSR REG32(STM32_EXTI_BASE + 0x00)
#define STM32_EXTI_FTSR REG32(STM32_EXTI_BASE + 0x04)
#define STM32_EXTI_SWIER REG32(STM32_EXTI_BASE + 0x08)
#define STM32_EXTI_RPR REG32(STM32_EXTI_BASE + 0x0C)
#define STM32_EXTI_FPR REG32(STM32_EXTI_BASE + 0x10)
#define STM32_EXTI_RTSR2 REG32(STM32_EXTI_BASE + 0x20)
#define STM32_EXTI_FTSR2 REG32(STM32_EXTI_BASE + 0x24)
#define STM32_EXTI_SWIER2 REG32(STM32_EXTI_BASE + 0x28)
#define STM32_EXTI_RPR2 REG32(STM32_EXTI_BASE + 0x2C)
#define STM32_EXTI_FPR2 REG32(STM32_EXTI_BASE + 0x30)
#define STM32_EXTI_EXTICR(n) REG32(STM32_EXTI_BASE + 0x60 + 4 * (n))
#define STM32_EXTI_IMR REG32(STM32_EXTI_BASE + 0x80)
#define STM32_EXTI_EMR REG32(STM32_EXTI_BASE + 0x84)
#define STM32_EXTI_IMR2 REG32(STM32_EXTI_BASE + 0x80)
#define STM32_EXTI_EMR2 REG32(STM32_EXTI_BASE + 0x84)

#define EXTI_RTC_ALR_EVENT BIT(18)

