FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
/* --- ADC --- */
#define STM32_ADC1_ISR REG32(STM32_ADC1_BASE + 0x00)
#define STM32_ADC1_ISR_ADRDY BIT(0)
#define STM32_ADC1_IER REG32(STM32_ADC1_BASE + 0x04)
#define STM32_ADC1_IER_AWDIE BIT(7)
#define STM32_ADC1_IER_OVRIE BIT(4)
#define STM32_ADC1_IER_EOSEQIE BIT(3)
#define STM32_ADC1_IER_EOCIE BIT(2)
#define STM32_ADC1_IER_EOSMPIE BIT(1)
#define STM32_ADC1_IER_ADRDYIE BIT(0)

#define STM32_ADC1_CR REG32(STM32_ADC1_BASE + 0x08)
#define STM32_ADC1_CR_ADEN BIT(0)
#define STM32_ADC1_CR_ADDIS BIT(1)
#define STM32_ADC1_CR_ADSTP BIT(4)
#define STM32_ADC1_CR_ADVREGEN BIT(28)
#define STM32_ADC1_CR_DEEPPWD BIT(29)
#define STM32_ADC1_CR_ADCAL BIT(31)
#define STM32_ADC1_CFGR REG32(STM32_ADC1_BASE + 0x0C)
/* Analog watchdog channel selection */
#define STM32_ADC1_CFGR_AWDCH_MASK (0x1f << 26)
#define STM32_ADC1_CFGR_AWDEN BIT(23)
#define STM32_ADC1_CFGR_AWDSGL BIT(22)
#define STM32_ADC1_CFGR_AUTDLY BIT(14)
/* Selects single vs continuous */
#define STM32_ADC1_CFGR_CONT BIT(13)
/* Selects ADC_DR overwrite vs preserve */
#define STM32_ADC1_CFGR_OVRMOD BIT(12)
/* External trigger polarity selection */
#define STM32_ADC1_CFGR_EXTEN_DIS (0 << 10)
#define STM32_ADC1_CFGR_EXTEN_RISE (1 << 10)
#define STM32_ADC1_CFGR_EXTEN_FALL (2 << 10)
#define STM32_ADC1_CFGR_EXTEN_BOTH (3 << 10)
#define STM32_ADC1_CFGR_EXTEN_MASK (3 << 10)
#define STM32_ADC1_CFGR_ALIGN BIT(5)
/* External trigger selection */
#define STM32_ADC1_CFGR_TRG0 (0 << 6)
#define STM32_ADC1_CFGR_TRG1 (1 << 6)
#define STM32_ADC1_CFGR_TRG2 (2 << 6)
#define STM32_ADC1_CFGR_TRG3 (3 << 6)
#define STM32_ADC1_CFGR_TRG4 (4 << 6)
#define STM32_ADC1_CFGR_TRG5 (5 << 6)
#define STM32_ADC1_CFGR_TRG6 (6 << 6)
#define STM32_ADC1_CFGR_TRG7 (7 << 6)
#define STM32_ADC1_CFGR_TRG_MASK (7 << 6)
/* Selects circular vs one-shot */
#define STM32_ADC1_CFGR_DMACFG BIT(1)
#define STM32_ADC1_CFGR_DMAEN BIT(0)
#define STM32_ADC1_CFGR2 REG32(STM32_ADC1_BASE + 0x10)
/* Sampling time selection - 1.5 ADC cycles min, 239.5 cycles max */
#define STM32_ADC1_SMPR1 REG32(STM32_ADC1_BASE + 0x14)
#define STM32_ADC1_SMPR2 REG32(STM32_ADC1_BASE + 0x18)
/* Macro to convert enum stm32_adc_smpr to SMP bits of the ADC_SMPR register */
#define STM32_ADC1_SMPR_SMP(s) ((s)-1)
#define STM32_ADC1_TR REG32(STM32_ADC1_BASE + 0x20)
#define STM32_ADC1_CHSELR REG32(STM32_ADC1_BASE + 0x28)
#define STM32_ADC1_DR REG32(STM32_ADC1_BASE + 0x40)
#define STM32_ADC1_JSQR REG32(STM32_ADC1_BASE + 0x4C)
#define STM32_ADC1_JDR1 REG32(STM32_ADC1_BASE + 0x80)
#define STM32_ADC1_JDR2 REG32(STM32_ADC1_BASE + 0x84)
#define STM32_ADC1_JDR3 REG32(STM32_ADC1_BASE + 0x88)
#define STM32_ADC1_JDR4 REG32(STM32_ADC1_BASE + 0x8C)
#define STM32_ADC1_CCR REG32(STM32_ADC1_BASE + 0x308)

/* --- USB --- */
#define STM32_USB_BCDR_DPPU BIT(15)

/* --- DMA --- */

/*
 * Available DMA channels, numbered from 0.
 *
 * Note: The STM datasheet tends to number things from 1. We should ask
 * the European elevator engineers to talk to MCU engineer counterparts
 * about this.  This means that if the datasheet refers to channel n,
 * you need to use STM32_DMAC_CHn (=n-1) in the code.
 *
 * Also note that channels are overloaded; obviously you can only use one
 * function on each channel at a time.
 */
enum dma_channel {
	/* Channel numbers */
	STM32_DMAC_CH1 = 0,
	STM32_DMAC_CH2 = 1,
	STM32_DMAC_CH3 = 2,
	STM32_DMAC_CH4 = 3,
	STM32_DMAC_CH5 = 4,
	STM32_DMAC_CH6 = 5,
	STM32_DMAC_CH7 = 6,
	/*
	 * Skip CH8, it should belong to DMA engine 1.
	 * Sharing code with STM32s that have 16 engines will be easier.
	 */
	STM32_DMAC_CH9 = 8,
	STM32_DMAC_CH10 = 9,
	STM32_DMAC_CH11 = 10,
	STM32_DMAC_CH12 = 11,
	STM32_DMAC_CH13 = 12,
	STM32_DMAC_CH14 = 13,
	STM32_DMAC_CH15 = 14,

	/* Channel functions */
	STM32_DMAC_SPI1_RX = STM32_DMAC_CH2,
	STM32_DMAC_SPI1_TX = STM32_DMAC_CH3,
	STM32_DMAC_USART1_TX = STM32_DMAC_CH14,
	STM32_DMAC_USART1_RX = STM32_DMAC_CH15,
	STM32_DMAC_SPI2_RX = STM32_DMAC_CH4,
	STM32_DMAC_SPI2_TX = STM32_DMAC_CH5,
	STM32_DMAC_SPI3_RX = STM32_DMAC_CH9,
	STM32_DMAC_SPI3_TX = STM32_DMAC_CH10,
	STM32_DMAC_COUNT = 15,
};

#define STM32_DMAC_PER_CTLR 8

/* Registers for a single channel of the DMA controller */
struct stm32_dma_chan {
	uint32_t ccr; /* Control */
	uint32_t cndtr; /* Number of data to transfer */
	uint32_t cpar; /* Peripheral address */
	uint32_t cmar; /* Memory address */
	uint32_t reserved;
};

/* Always use stm32_dma_chan_t so volatile keyword is included! */
typedef volatile struct stm32_dma_chan stm32_dma_chan_t;

/* Common code and header file must use this */
typedef stm32_dma_chan_t dma_chan_t;

/* Registers for the DMA controller */
struct stm32_dma_regs {
	uint32_t isr;
	uint32_t ifcr;
	stm32_dma_chan_t chan[STM32_DMAC_COUNT];
};

/* Always use stm32_dma_regs_t so volatile keyword is included! */
typedef volatile struct stm32_dma_regs stm32_dma_regs_t;

#define STM32_DMA1_REGS ((stm32_dma_regs_t *)STM32_DMA1_BASE)

#define STM32_DMA_CCR_CHANNEL(channel) (0)
#define STM32_DMA2_REGS ((stm32_dma_regs_t *)STM32_DMA2_BASE)
#define STM32_DMA_REGS(channel) \
	((channel) < STM32_DMAC_PER_CTLR ? STM32_DMA1_REGS : STM32_DMA2_REGS)
#define STM32_DMA_CSELR(channel)                                    \
	REG32(((channel) < STM32_DMAC_PER_CTLR ? STM32_DMA1_BASE :  \
						 STM32_DMA2_BASE) + \
	      0xA8)

/* Bits for DMA controller regs (isr and ifcr) */
#define STM32_DMA_CH_OFFSET(channel) (4 * ((channel) % STM32_DMAC_PER_CTLR))
#define STM32_DMA_ISR_MASK(channel, mask) \
	((mask) << STM32_DMA_CH_OFFSET(channel))
#define STM32_DMA_ISR_GIF(channel) STM32_DMA_ISR_MASK(channel, BIT(0))
#define STM32_DMA_ISR_TCIF(channel) STM32_DMA_ISR_MASK(channel, BIT(1))
#define STM32_DMA_ISR_HTIF(channel) STM32_DMA_ISR_MASK(channel, BIT(2))
#define STM32_DMA_ISR_TEIF(channel) STM32_DMA_ISR_MASK(channel, BIT(3))
#define STM32_DMA_ISR_ALL(channel) STM32_DMA_ISR_MASK(channel, 0x0f)

#define STM32_DMA_GIF BIT(0)
#define STM32_DMA_TCIF BIT(1)
#define STM32_DMA_HTIF BIT(2)
#define STM32_DMA_TEIF BIT(3)
#define STM32_DMA_ALL 0xf

#define STM32_DMA_GET_ISR(channel)                                        \
	((STM32_DMA_REGS(channel)->isr >> STM32_DMA_CH_OFFSET(channel)) & \
	 STM32_DMA_ALL)
#define STM32_DMA_SET_ISR(channel, val)                                \
	(STM32_DMA_REGS(channel)->isr =                                \
		 ((STM32_DMA_REGS(channel)->isr &                      \
		   ~(STM32_DMA_ALL << STM32_DMA_CH_OFFSET(channel))) | \
		  (((val)&STM32_DMA_ALL) << STM32_DMA_CH_OFFSET(channel))))
#define STM32_DMA_GET_IFCR(channel)                                        \
	((STM32_DMA_REGS(channel)->ifcr >> STM32_DMA_CH_OFFSET(channel)) & \
	 STM32_DMA_ALL)
#define STM32_DMA_SET_IFCR(channel, val)                               \
	(STM32_DMA_REGS(channel)->ifcr =                               \
		 ((STM32_DMA_REGS(channel)->ifcr &                     \
		   ~(STM32_DMA_ALL << STM32_DMA_CH_OFFSET(channel))) | \
		  (((val)&STM32_DMA_ALL) << STM32_DMA_CH_OFFSET(channel))))

/* Bits for DMA channel regs */
#define STM32_DMA_CCR_EN BIT(0)
#define STM32_DMA_CCR_TCIE BIT(1)
#define STM32_DMA_CCR_HTIE BIT(2)
#define STM32_DMA_CCR_TEIE BIT(3)
#define STM32_DMA_CCR_DIR BIT(4)
#define STM32_DMA_CCR_CIRC BIT(5)
#define STM32_DMA_CCR_PINC BIT(6)
#define STM32_DMA_CCR_MINC BIT(7)
#define STM32_DMA_CCR_PSIZE_8_BIT (0 << 8)
#define STM32_DMA_CCR_PSIZE_16_BIT (1 << 8)
#define STM32_DMA_CCR_PSIZE_32_BIT (2 << 8)
#define STM32_DMA_CCR_MSIZE_8_BIT (0 << 10)
#define STM32_DMA_CCR_MSIZE_16_BIT (1 << 10)
#define STM32_DMA_CCR_MSIZE_32_BIT (2 << 10)
#define STM32_DMA_CCR_PL_LOW (0 << 12)
#define STM32_DMA_CCR_PL_MEDIUM (1 << 12)
#define STM32_DMA_CCR_PL_HIGH (2 << 12)
#define STM32_DMA_CCR_PL_VERY_HIGH (3 << 12)
#define STM32_DMA_CCR_MEM2MEM BIT(14)

/* The requests for the DMA1/DMA2 controllers are routed through DMAMUX. */
/* DMAMUX registers */
#define STM32_DMAMUX_CxCR(x) REG32(STM32_DMAMUX_BASE + 4 * (x))
#define STM32_DMAMUX_CSR REG32(STM32_DMAMUX_BASE + 0x80)
#define STM32_DMAMUX_CFR REG32(STM32_DMAMUX_BASE + 0x84)
#define STM32_DMAMUX_RGxCR(x) REG32(STM32_DMAMUX_BASE + 0x100 + 4 * (x))
#define STM32_DMAMUX_RGSR REG32(STM32_DMAMUX_BASE + 0x140)
#define STM32_DMAMUX_RGCFR REG32(STM32_DMAMUX_BASE + 0x144)

enum dmamux1_request {
	DMAMUX_REQ_ADC1 = 5,
	DMAMUX_REQ_ADC2 = 6,
	DMAMUX_REQ_DAC1 = 7,
	DMAMUX_REQ_DAC2 = 8,
	DMAMUX_REQ_TIM6_UP = 9,
	DMAMUX_REQ_TIM7_UP = 10,
	DMAMUX_REQ_SPI1_RX = 11,
	DMAMUX_REQ_SPI1_TX = 12,
	DMAMUX_REQ_SPI2_RX = 13,
	DMAMUX_REQ_SPI2_TX = 14,
	DMAMUX_REQ_SPI3_RX = 15,
	DMAMUX_REQ_SPI3_TX = 16,
	DMAMUX_REQ_I2C1_RX = 17,
	DMAMUX_REQ_I2C1_TX = 18,
	DMAMUX_REQ_I2C2_RX = 19,
	DMAMUX_REQ_I2C2_TX = 20,
	DMAMUX_REQ_I2C3_RX = 21,
	DMAMUX_REQ_I2C3_TX = 22,
	DMAMUX_REQ_I2C4_RX = 23,
	DMAMUX_REQ_I2C4_TX = 24,
	DMAMUX_REQ_USART1_RX = 25,
	DMAMUX_REQ_USART1_TX = 26,
	DMAMUX_REQ_USART2_RX = 27,
	DMAMUX_REQ_USART2_TX = 28,
	DMAMUX_REQ_USART3_RX = 29,
	DMAMUX_REQ_USART3_TX = 30,
	DMAMUX_REQ_UART4_RX = 31,
	DMAMUX_REQ_UART4_TX = 32,
	DMAMUX_REQ_UART5_RX = 33,
	DMAMUX_REQ_UART5_TX = 34,
	DMAMUX_REQ_LPUART1_RX = 35,
	DMAMUX_REQ_LPUART1_TX = 36,
	DMAMUX_REQ_SAI1_A = 37,
	DMAMUX_REQ_SAI1_B = 38,
	DMAMUX_REQ_SAI2_A = 39,
	DMAMUX_REQ_SAI2_B = 40,
	DMAMUX_REQ_OCTOSPI1 = 41,
	DMAMUX_REQ_TIM1_CH1 = 42,
	DMAMUX_REQ_TIM1_CH2 = 43,
	DMAMUX_REQ_TIM1_CH3 = 44,
	DMAMUX_REQ_TIM1_CH4 = 45,
	DMAMUX_REQ_TIM1_UP = 46,
	DMAMUX_REQ_TIM1_TRIG = 47,
	DMAMUX_REQ_TIM1_COM = 48,
	DMAMUX_REQ_TIM8_CH1 = 49,
	DMAMUX_REQ_TIM8_CH2 = 50,
	DMAMUX_REQ_TIM8_CH3 = 51,
	DMAMUX_REQ_TIM8_CH4 = 52,
	DMAMUX_REQ_TIM8_UP = 53,
	DMAMUX_REQ_TIM8_TRIG = 54,
	DMAMUX_REQ_TIM8_COM = 55,
	DMAMUX_REQ_TIM2_CH1 = 56,
	DMAMUX_REQ_TIM2_CH2 = 57,
	DMAMUX_REQ_TIM2_CH3 = 58,
	DMAMUX_REQ_TIM2_CH4 = 59,
	DMAMUX_REQ_TIM2_UP = 60,
	DMAMUX_REQ_TIM3_CH1 = 61,
	DMAMUX_REQ_TIM3_CH2 = 62,
	DMAMUX_REQ_TIM3_CH3 = 63,
	DMAMUX_REQ_TIM3_CH4 = 64,
	DMAMUX_REQ_TIM3_UP = 65,
	DMAMUX_REQ_TIM3_TRIG = 66,
	DMAMUX_REQ_TIM4_CH1 = 67,
	DMAMUX_REQ_TIM4_CH2 = 68,
	DMAMUX_REQ_TIM4_CH3 = 69,
	DMAMUX_REQ_TIM4_CH4 = 70,
	DMAMUX_REQ_TIM4_UP = 71,
	DMAMUX_REQ_TIM5_CH1 = 72,
	DMAMUX_REQ_TIM5_CH2 = 73,
	DMAMUX_REQ_TIM5_CH3 = 74,
	DMAMUX_REQ_TIM5_CH4 = 75,
	DMAMUX_REQ_TIM5_UP = 76,
	DMAMUX_REQ_TIM5_TRIG = 77,
	DMAMUX_REQ_TIM15_CH1 = 78,
	DMAMUX_REQ_TIM15_UP = 79,
	DMAMUX_REQ_TIM15_TRIG = 80,
	DMAMUX_REQ_TIM15_COM = 81,
	DMAMUX_REQ_TIM16_CH1 = 82,
	DMAMUX_REQ_TIM16_UP = 83,
	DMAMUX_REQ_TIM17_CH1 = 84,
	DMAMUX_REQ_TIM17_UP = 85,
	DMAMUX_REQ_DFSDM1_FLT0 = 86,
	DMAMUX_REQ_DFSDM1_FLT1 = 87,
	DMAMUX_REQ_DFSDM1_FLT2 = 88,
	DMAMUX_REQ_DFSDM1_FLT3 = 89,
	DMAMUX_REQ_AES_IN = 90,
	DMAMUX_REQ_AES_OUT = 91,
	DMAMUX_REQ_HASH_IN = 92,
	DMAMUX_REQ_USBPD_TX = 93,
	DMAMUX_REQ_USBPD_RX = 94,
};

/* LPUART gets accessed as UART9 in STM32 uart module */
#define STM32_USART9_BASE STM32_LPUART1_BASE
#define STM32_IRQ_USART9 STM32_IRQ_LPUART1
#define DMAMUX_REQ_UART9_RX DMAMUX_REQ_LPUART1_RX
#define DMAMUX_REQ_UART9_TX DMAMUX_REQ_LPUART1_TX

/* --- OCTOSPI --- */

#define STM32_OCTOSPI_CR REG32(STM32_OCTOSPI_BASE + 0x00)
#define STM32_OCTOSPI_DCR1 REG32(STM32_OCTOSPI_BASE + 0x08)
#define STM32_OCTOSPI_DCR2 REG32(STM32_OCTOSPI_BASE + 0x0C)
#define STM32_OCTOSPI_DCR3 REG32(STM32_OCTOSPI_BASE + 0x10)
#define STM32_OCTOSPI_DCR4 REG32(STM32_OCTOSPI_BASE + 0x14)
#define STM32_OCTOSPI_SR REG32(STM32_OCTOSPI_BASE + 0x20)
#define STM32_OCTOSPI_FCR REG32(STM32_OCTOSPI_BASE + 0x24)
#define STM32_OCTOSPI_DLR REG32(STM32_OCTOSPI_BASE + 0x40)
#define STM32_OCTOSPI_AR REG32(STM32_OCTOSPI_BASE + 0x48)
#define STM32_OCTOSPI_DR REG32(STM32_OCTOSPI_BASE + 0x50)
#define STM32_OCTOSPI_PSMKR REG32(STM32_OCTOSPI_BASE + 0x80)
#define STM32_OCTOSPI_PSMAR REG32(STM32_OCTOSPI_BASE + 0x88)
#define STM32_OCTOSPI_PIR REG32(STM32_OCTOSPI_BASE + 0x90)
#define STM32_OCTOSPI_CCR REG32(STM32_OCTOSPI_BASE + 0x100)
#define STM32_OCTOSPI_TCR REG32(STM32_OCTOSPI_BASE + 0x108)
#define STM32_OCTOSPI_IR REG32(STM32_OCTOSPI_BASE + 0x110)
#define STM32_OCTOSPI_ABR REG32(STM32_OCTOSPI_BASE + 0x120)
#define STM32_OCTOSPI_LPTR REG32(STM32_OCTOSPI_BASE + 0x130)
#define STM32_OCTOSPI_WPCCR REG32(STM32_OCTOSPI_BASE + 0x140)
#define STM32_OCTOSPI_WPTCR REG32(STM32_OCTOSPI_BASE + 0x148)
#define STM32_OCTOSPI_WPIR REG32(STM32_OCTOSPI_BASE + 0x150)
#define STM32_OCTOSPI_WPABR REG32(STM32_OCTOSPI_BASE + 0x160)
#define STM32_OCTOSPI_WCCR REG32(STM32_OCTOSPI_BASE + 0x180)
#define STM32_OCTOSPI_WTCR REG32(STM32_OCTOSPI_BASE + 0x188)
#define STM32_OCTOSPI_WIR REG32(STM32_OCTOSPI_BASE + 0x190)
#define STM32_OCTOSPI_WABR REG32(STM32_OCTOSPI_BASE + 0x1A0)
#define STM32_OCTOSPI_HLCR REG32(STM32_OCTOSPI_BASE + 0x200)

/* Bit values for STM32_OCTOSPI_CR */
#define STM32_OCTOSPI_CR_FMODE_POS 28U
#define STM32_OCTOSPI_CR_FMODE_MSK (0x3UL << STM32_OCTOSPI_CR_FMODE_POS)
#define STM32_OCTOSPI_CR_FMODE STM32_OCTOSPI_FMODE_MSK
#define STM32_OCTOSPI_CR_FMODE_IND_WRITE (0x0UL << STM32_OCTOSPI_CR_FMODE_POS)
#define STM32_OCTOSPI_CR_FMODE_IND_READ (0x1UL << STM32_OCTOSPI_CR_FMODE_POS)
#define STM32_OCTOSPI_CR_FMODE_AUTO_POLL (0x2UL << STM32_OCTOSPI_CR_FMODE_POS)
#define STM32_OCTOSPI_CR_FMODE_MEM_MAPPED (0x3UL << STM32_OCTOSPI_CR_FMODE_POS)

