FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32l5.h
#define STM32_OCTOSPI_CR_PMM_POS 23U
#define STM32_OCTOSPI_CR_PMM_MSK (0x1UL << STM32_OCTOSPI_CR_PMM_POS)
#define STM32_OCTOSPI_CR_PMM_AND 0
#define STM32_OCTOSPI_CR_PMM_OR STM32_OCTOSPI_CR_PMM_MSK

#define STM32_OCTOSPI_CR_APMS_POS 22U
#define STM32_OCTOSPI_CR_APMS_MSK (0x1UL << STM32_OCTOSPI_CR_APMS_POS)
#define STM32_OCTOSPI_CR_APMS STM32_OCTOSPI_CR_APMS_MSK

#define STM32_OCTOSPI_CR_TOIE_POS 20U
#define STM32_OCTOSPI_CR_TOIE_MSK (0x1UL << STM32_OCTOSPI_CR_TOIE_POS)
#define STM32_OCTOSPI_CR_TOIE STM32_OCTOSPI_CR_TOIE_MSK

#define STM32_OCTOSPI_CR_SMIE_POS 19U
#define STM32_OCTOSPI_CR_SMIE_MSK (0x1UL << STM32_OCTOSPI_CR_SMIE_POS)
#define STM32_OCTOSPI_CR_SMIE STM32_OCTOSPI_CR_SMIE_MSK

#define STM32_OCTOSPI_CR_FTIE_POS 18U
#define STM32_OCTOSPI_CR_FTIE_MSK (0x1UL << STM32_OCTOSPI_CR_FTIE_POS)
#define STM32_OCTOSPI_CR_FTIE STM32_OCTOSPI_CR_FTIE_MSK

#define STM32_OCTOSPI_CR_TCIE_POS 17U
#define STM32_OCTOSPI_CR_TCIE_MSK (0x1UL << STM32_OCTOSPI_CR_TCIE_POS)
#define STM32_OCTOSPI_CR_TCIE STM32_OCTOSPI_CR_TCIE_MSK

#define STM32_OCTOSPI_CR_TEIE_POS 16U
#define STM32_OCTOSPI_CR_TEIE_MSK (0x1UL << STM32_OCTOSPI_CR_TEIE_POS)
#define STM32_OCTOSPI_CR_TEIE STM32_OCTOSPI_CR_TEIE_MSK

#define STM32_OCTOSPI_CR_FTHRES_POS 8U
#define STM32_OCTOSPI_CR_FTHRES_MSK (0x1FUL << STM32_OCTOSPI_CR_FTHRES_POS)

#define STM32_OCTOSPI_CR_MSEL_POS 7U
#define STM32_OCTOSPI_CR_MSEL_MSK (0x1UL << STM32_OCTOSPI_CR_MSEL_POS)
#define STM32_OCTOSPI_CR_MSEL_FLASH1 0
#define STM32_OCTOSPI_CR_MSEL_FLASH2 STM32_OCTOSPI_CR_MSEL_MSK

#define STM32_OCTOSPI_CR_DMM_POS 6U
#define STM32_OCTOSPI_CR_DMM_MSK (0x1UL << STM32_OCTOSPI_CR_DMM_POS)
#define STM32_OCTOSPI_CR_DMM STM32_OCTOSPI_CR_DMM_MSK

#define STM32_OCTOSPI_CR_TCEN_POS 3U
#define STM32_OCTOSPI_CR_TCEN_MSK (0x1UL << STM32_OCTOSPI_CR_TCEN_POS)
#define STM32_OCTOSPI_CR_TCEN STM32_OCTOSPI_CR_TCEN_MSK

#define STM32_OCTOSPI_CR_DMAEN_POS 2U
#define STM32_OCTOSPI_CR_DMAEN_MSK (0x1UL << STM32_OCTOSPI_CR_DMAEN_POS)
#define STM32_OCTOSPI_CR_DMAEN STM32_OCTOSPI_CR_DMAEN_MSK

#define STM32_OCTOSPI_CR_ABORT_POS 1U
#define STM32_OCTOSPI_CR_ABORT_MSK (0x1UL << STM32_OCTOSPI_CR_ABORT_POS)
#define STM32_OCTOSPI_CR_ABORT STM32_OCTOSPI_CR_ABORT_MSK

#define STM32_OCTOSPI_CR_EN_POS 0U
#define STM32_OCTOSPI_CR_EN_MSK (0x1UL << STM32_OCTOSPI_CR_EN_POS)
#define STM32_OCTOSPI_CR_EN STM32_OCTOSPI_CR_EN_MSK

/* Bit values for STM32_OCTOSPI_DCR1 */
#define STM32_OCTOSPI_DCR1_MTYP_POS 24U
#define STM32_OCTOSPI_DCR1_MTYP_MSK (0x7UL << STM32_OCTOSPI_DCR1_MTYP_POS)
#define STM32_OCTOSPI_DCR1_MTYP_MICROS (0x0UL << STM32_OCTOSPI_DCR1_MTYP_POS)
#define STM32_OCTOSPI_DCR1_MTYP_MACRONIX (0x1UL << STM32_OCTOSPI_DCR1_MTYP_POS)
#define STM32_OCTOSPI_DCR1_MTYP_STANDARD (0x2UL << STM32_OCTOSPI_DCR1_MTYP_POS)
#define STM32_OCTOSPI_DCR1_MTYP_MACRONIX_RAM \
	(0x3UL << STM32_OCTOSPI_DCR1_MTYP_POS)
#define STM32_OCTOSPI_DCR1_MTYP_HYPERBUS_MEM \
	(0x4UL << STM32_OCTOSPI_DCR1_MTYP_POS)
#define STM32_OCTOSPI_DCR1_MTYP_HYPERBUS_REG \
	(0x5UL << STM32_OCTOSPI_DCR1_MTYP_POS)

#define STM32_OCTOSPI_DCR1_DEVSIZE_POS 16U
#define STM32_OCTOSPI_DCR1_DEVSIZE_MSK \
	(0x1FUL << STM32_OCTOSPI_DCR1_DEVSIZE_POS)

#define STM32_OCTOSPI_DCR1_CSHT_POS 8U
#define STM32_OCTOSPI_DCR1_CSHT_MSK (0x1UL << STM32_OCTOSPI_DCR1_CSHT_POS)
#define STM32_OCTOSPI_DCR1_CSHT_1 (0x0UL << STM32_OCTOSPI_DCR1_CSHT_POS)
#define STM32_OCTOSPI_DCR1_CSHT_2 (0x1UL << STM32_OCTOSPI_DCR1_CSHT_POS)
#define STM32_OCTOSPI_DCR1_CSHT_3 (0x2UL << STM32_OCTOSPI_DCR1_CSHT_POS)
#define STM32_OCTOSPI_DCR1_CSHT_4 (0x3UL << STM32_OCTOSPI_DCR1_CSHT_POS)
#define STM32_OCTOSPI_DCR1_CSHT_5 (0x4UL << STM32_OCTOSPI_DCR1_CSHT_POS)
#define STM32_OCTOSPI_DCR1_CSHT_6 (0x5UL << STM32_OCTOSPI_DCR1_CSHT_POS)
#define STM32_OCTOSPI_DCR1_CSHT_7 (0x6UL << STM32_OCTOSPI_DCR1_CSHT_POS)
#define STM32_OCTOSPI_DCR1_CSHT_8 (0x7UL << STM32_OCTOSPI_DCR1_CSHT_POS)

#define STM32_OCTOSPI_DCR1_DLYBYP_POS 3U
#define STM32_OCTOSPI_DCR1_DLYBYP_MSK (0x1UL << STM32_OCTOSPI_DCR1_DLYBYP_POS)
#define STM32_OCTOSPI_DCR1_DLYBYP STM32_OCTOSPI_DCR1_DLYBYP_MSK

#define STM32_OCTOSPI_DCR1_FRCK_POS 1U
#define STM32_OCTOSPI_DCR1_FRCK_MSK (0x1UL << STM32_OCTOSPI_DCR1_FRCK_POS)
#define STM32_OCTOSPI_DCR1_FRCK STM32_OCTOSPI_DCR1_FRCK_MSK

#define STM32_OCTOSPI_DCR1_CKMODE_POS 0U
#define STM32_OCTOSPI_DCR1_CKMODE_MSK (0x1UL << STM32_OCTOSPI_DCR1_CKMODE_POS)
#define STM32_OCTOSPI_DCR1_CKMODE_LOW 0
#define STM32_OCTOSPI_DCR1_CKMODE_HIGH STM32_OCTOSPI_DCR1_CKMODE_MSK

/* Bit values for STM32_OCTOSPI_DCR2 */
#define STM32_OCTOSPI_DCR2_WRAPSIZE_POS 16U
#define STM32_OCTOSPI_DCR2_WRAPSIZE_MSK \
	(0x7UL << STM32_OCTOSPI_DCR2_WRAPSIZE_POS)

#define STM32_OCTOSPI_DCR2_PRESCALER_POS 0U
#define STM32_OCTOSPI_DCR2_PRESCALER_MSK \
	(0xFFUL << STM32_OCTOSPI_DCR2_PRESCALER_POS)

/* Bit values for STM32_OCTOSPI_DCR3 */
#define STM32_OCTOSPI_DCR3_CSBOUND_POS 16U
#define STM32_OCTOSPI_DCR3_CSBOUND_MSK \
	(0x1FUL << STM32_OCTOSPI_DCR3_CSBOUND_POS)
#define STM32_OCTOSPI_DCR3_CSBOUND_DISABLED 0

/* Bit values for STM32_OCTOSPI_SR */
#define STM32_OCTOSPI_SR_FLEVEL_POS 8U
#define STM32_OCTOSPI_SR_FLEVEL_MSK (0x3FUL << STM32_OCTOSPI_SR_FLEVEL_POS)

#define STM32_OCTOSPI_SR_BUSY_POS 5U
#define STM32_OCTOSPI_SR_BUSY_MSK (0x1UL << STM32_OCTOSPI_SR_BUSY_POS)
#define STM32_OCTOSPI_SR_BUSY STM32_OCTOSPI_SR_BUSY_MSK

#define STM32_OCTOSPI_SR_TOF_POS 4U
#define STM32_OCTOSPI_SR_TOF_MSK (0x1UL << STM32_OCTOSPI_SR_TOF_POS)
#define STM32_OCTOSPI_SR_TOF STM32_OCTOSPI_SR_TOF_MSK

#define STM32_OCTOSPI_SR_SMF_POS 3U
#define STM32_OCTOSPI_SR_SMF_MSK (0x1UL << STM32_OCTOSPI_SR_SMF_POS)
#define STM32_OCTOSPI_SR_SMF STM32_OCTOSPI_SR_SMF_MSK

#define STM32_OCTOSPI_SR_FTF_POS 2U
#define STM32_OCTOSPI_SR_FTF_MSK (0x1UL << STM32_OCTOSPI_SR_FTF_POS)
#define STM32_OCTOSPI_SR_FTF STM32_OCTOSPI_SR_FTF_MSK

#define STM32_OCTOSPI_SR_TCF_POS 1U
#define STM32_OCTOSPI_SR_TCF_MSK (0x1UL << STM32_OCTOSPI_SR_TCF_POS)
#define STM32_OCTOSPI_SR_TCF STM32_OCTOSPI_SR_TCF_MSK

#define STM32_OCTOSPI_SR_TEF_POS 0U
#define STM32_OCTOSPI_SR_TEF_MSK (0x1UL << STM32_OCTOSPI_SR_TEF_POS)
#define STM32_OCTOSPI_SR_TEF STM32_OCTOSPI_SR_TEF_MSK

